# nutrition_data.py

sandwich_nutrition = {
    "안창 비프" : {'중량 (g)': 235.0, '열량 (kcal)': 342.0, '단백질 (g)': 21.6, '포화지방 (g)': 4.3, '당류 (g)': 8.3, '나트륨 (mg)': 830.0},
    "안창 비프 썹픽" : {'중량 (g)': 265.0, '열량 (kcal)': 475.0, '단백질 (g)': 22.6, '포화지방 (g)': 7.4, '당류 (g)': 10.0, '나트륨 (mg)': 1144.0},
    "안창 비프&머쉬룸" : {'중량 (g)': 235.0, '열량 (kcal)': 292.0, '단백질 (g)': 16.5, '포화지방 (g)': 2.5, '당류 (g)': 8.0, '나트륨 (mg)': 598.0},
    "안창 비프&머쉬룸 썹픽" : {'중량 (g)': 265.0, '열량 (kcal)': 427.0, '단백질 (g)': 19.0, '포화지방 (g)': 5.7, '당류 (g)': 11.8, '나트륨 (mg)': 967.0},
    "머쉬룸" : {'중량 (g)': 235.0, '열량 (kcal)': 245.0, '단백질 (g)': 11.8, '포화지방 (g)': 0.6, '당류 (g)': 7.7, '나트륨 (mg)': 376.0},
    "머쉬룸 썹픽" : {'중량 (g)': 251.0, '열량 (kcal)': 390.0, '단백질 (g)': 13.8, '포화지방 (g)': 3.8, '당류 (g)': 7.2, '나트륨 (mg)': 909.0},
    "터키 베이컨 아보카도" : {'중량 (g)': 246.0, '열량 (kcal)': 355.0, '단백질 (g)': 20.2, '포화지방 (g)': 3.2, '당류 (g)': 9.0, '나트륨 (mg)': 940.0},
    "써브웨이 클럽" : {'중량 (g)': 216.0, '열량 (kcal)': 299.0, '단백질 (g)': 19.8, '포화지방 (g)': 2.4, '당류 (g)': 8.53, '나트륨 (mg)': 853.0},
    "터키" : {'중량 (g)': 221.0, '열량 (kcal)': 265.0, '단백질 (g)': 18.6, '포화지방 (g)': 0.9, '당류 (g)': 8.7, '나트륨 (mg)': 751.0},
    "에그 슬라이스" : {'중량 (g)': 214.0, '열량 (kcal)': 279.0, '단백질 (g)': 15.2, '포화지방 (g)': 2.3, '당류 (g)': 7.6, '나트륨 (mg)': 447.0},
    "이탈리안 비엠티 썹픽" : {'중량 (g)': 278.0, '열량 (kcal)': 548.0, '단백질 (g)': 22.0, '포화지방 (g)': 9.3, '당류 (g)': 10.4, '나트륨 (mg)': 1600.0},
    "스테이크&치즈 썹픽" : {'중량 (g)': 277.0, '열량 (kcal)': 507.0, '단백질 (g)': 26.2, '포화지방 (g)': 6.4, '당류 (g)': 7.1, '나트륨 (mg)': 1094.0},
    "로티세리 바비큐 치킨 썹픽" : {'중량 (g)': 273.0, '열량 (kcal)': 463.0, '단백질 (g)': 28.9, '포화지방 (g)': 5.6, '당류 (g)': 9.6, '나트륨 (mg)': 961.0},
    "스테이크 & 치즈" : {'중량 (g)': 245.0, '열량 (kcal)': 355.0, '단백질 (g)': 28.1, '포화지방 (g)': 4.2, '당류 (g)': 8.8, '나트륨 (mg)': 780.0},
    "스파이시 쉬림프" : {'중량 (g)': 213.0, '열량 (kcal)': 245.0, '단백질 (g)': 16.5, '포화지방 (g)': 0.9, '당류 (g)': 9.1, '나트륨 (mg)': 570.0},
    "쉬림프" : {'중량 (g)': 209.0, '열량 (kcal)': 241.0, '단백질 (g)': 16.3, '포화지방 (g)': 0.6, '당류 (g)': 7.9, '나트륨 (mg)': 415.0},
    "로스트 치킨" : {'중량 (g)': 237.0, '열량 (kcal)': 300.0, '단백질 (g)': 26.0, '포화지방 (g)': 1.3, '당류 (g)': 8.7, '나트륨 (mg)': 605.0},
    "로티세리 바비큐 치킨" : {'중량 (g)': 249.0, '열량 (kcal)': 327.0, '단백질 (g)': 29.1, '포화지방 (g)': 2.5, '당류 (g)': 7.8, '나트륨 (mg)': 542.0},
    "K-바비큐" : {'중량 (g)': 256.0, '열량 (kcal)': 372.0, '단백질 (g)': 25.6, '포화지방 (g)': 2.1, '당류 (g)': 14.7, '나트륨 (mg)': 899.0},
    "풀드 포크 바비큐" : {'중량 (g)': 235.0, '열량 (kcal)': 327.0, '단백질 (g)': 24.8, '포화지방 (g)': 2.1, '당류 (g)': 7.8, '나트륨 (mg)': 689.0},
    "치킨 데리야끼" : {'중량 (g)': 255.0, '열량 (kcal)': 314.0, '단백질 (g)': 26.5, '포화지방 (g)': 1.2, '당류 (g)': 10.1, '나트륨 (mg)': 698.0},
    "스파이시 이탈리안" : {'중량 (g)': 224.0, '열량 (kcal)': 464.0, '단백질 (g)': 20.7, '포화지방 (g)': 9.1, '당류 (g)': 8.7, '나트륨 (mg)': 1250.0},
    "이탈리안 비엠티" : {'중량 (g)': 228.0, '열량 (kcal)': 388.0, '단백질 (g)': 21.0, '포화지방 (g)': 5.9, '당류 (g)': 8.6, '나트륨 (mg)': 1064.0},
    "비엘티" : {'중량 (g)': 182.0, '열량 (kcal)': 300.0, '단백질 (g)': 15.9, '포화지방 (g)': 3.7, '당류 (g)': 7.9, '나트륨 (mg)': 666.0},
    "참치" : {'중량 (g)': 238.0, '열량 (kcal)': 316.0, '단백질 (g)': 26.9, '포화지방 (g)': 1.4, '당류 (g)': 7.6, '나트륨 (mg)': 535.0},
    "햄" : {'중량 (g)': 220.0, '열량 (kcal)': 262.0, '단백질 (g)': 19.0, '포화지방 (g)': 1.0, '당류 (g)': 8.4, '나트륨 (mg)': 680.0},
    "에그마요" : {'중량 (g)': 238.0, '열량 (kcal)': 416.0, '단백질 (g)': 16.4, '포화지방 (g)': 4.8, '당류 (g)': 7.7, '나트륨 (mg)': 554.0},
    "베지" : {'중량 (g)': 164.0, '열량 (kcal)': 209.0, '단백질 (g)': 9.2, '포화지방 (g)': 0.6, '당류 (g)': 7.6, '나트륨 (mg)': 262.0}
}

sub_salad_nutrition = {
    
     "안창 비프": {"중량 (g)": 342, "열량 (kcal)": 180, "단백질 (g)": 15, "포화지방 (g)": 4, "당류 (g)": 8, "나트륨 (mg)": 588},
    "스파이시 쉬림프": {"중량 (g)": 321, "열량 (kcal)": 83, "단백질 (g)": 9.8, "포화지방 (g)": 0.4, "당류 (g)": 8.7, "나트륨 (mg)": 328},
    "쉬림프": {"중량 (g)": 316, "열량 (kcal)": 79, "단백질 (g)": 9.6, "포화지방 (g)": 0.1, "당류 (g)": 7.5, "나트륨 (mg)": 173},
    "K-바비큐": {"중량 (g)": 363, "열량 (kcal)": 210, "단백질 (g)": 18.9, "포화지방 (g)": 1.6, "당류 (g)": 14.3, "나트륨 (mg)": 657},
    "풀드 포크 바비큐": {"중량 (g)": 342, "열량 (kcal)": 165, "단백질 (g)": 18.1, "포화지방 (g)": 1.6, "당류 (g)": 7.4, "나트륨 (mg)": 446},
    "치킨 데리야끼": {"중량 (g)": 362, "열량 (kcal)": 152, "단백질 (g)": 19.8, "포화지방 (g)": 0.7, "당류 (g)": 9.7, "나트륨 (mg)": 455},
    "써브웨이 클럽": {"중량 (g)": 324, "열량 (kcal)": 144, "단백질 (g)": 13.3, "포화지방 (g)": 1.8, "당류 (g)": 8.1, "나트륨 (mg)": 634},
    "머쉬룸": {"중량 (g)": 342, "열량 (kcal)": 83, "단백질 (g)": 5.1, "포화지방 (g)": 0.1, "당류 (g)": 7.3, "나트륨 (mg)": 133},
    "안창 비프&머쉬룸": {"중량 (g)": 342, "열량 (kcal)": 130, "단백질 (g)": 10, "포화지방 (g)": 2, "당류 (g)": 8, "나트륨 (mg)": 356},
    "스테이크 & 치즈": {"중량 (g)": 352, "열량 (kcal)": 193, "단백질 (g)": 21.4, "포화지방 (g)": 3.7, "당류 (g)": 8.4, "나트륨 (mg)": 538},
    "스파이시 이탈리안": {"중량 (g)": 331, "열량 (kcal)": 302, "단백질 (g)": 14, "포화지방 (g)": 8.6, "당류 (g)": 8.3, "나트륨 (mg)": 1008},
    "로스트 치킨": {"중량 (g)": 342, "열량 (kcal)": 165, "단백질 (g)": 18.1, "포화지방 (g)": 1.6, "당류 (g)": 7.4, "나트륨 (mg)": 446},
    "에그마요": {"중량 (g)": 342, "열량 (kcal)": 180, "단백질 (g)": 12, "포화지방 (g)": 4, "당류 (g)": 6, "나트륨 (mg)": 420},
    "베지": {"중량 (g)": 300, "열량 (kcal)": 60, "단백질 (g)": 2, "포화지방 (g)": 0.5, "당류 (g)": 5, "나트륨 (mg)": 210},
    "햄": {"중량 (g)": 330, "열량 (kcal)": 150, "단백질 (g)": 15, "포화지방 (g)": 1, "당류 (g)": 5, "나트륨 (mg)": 450},
    "참치": {"중량 (g)": 340, "열량 (kcal)": 200, "단백질 (g)": 14, "포화지방 (g)": 2.5, "당류 (g)": 6, "나트륨 (mg)": 550},
    "로티세리 치킨": {"중량 (g)": 330, "열량 (kcal)": 220, "단백질 (g)": 18, "포화지방 (g)": 2, "당류 (g)": 5, "나트륨 (mg)": 460},
    "치킨 베이컨 랜치": {"중량 (g)": 360, "열량 (kcal)": 260, "단백질 (g)": 20, "포화지방 (g)": 5, "당류 (g)": 6, "나트륨 (mg)": 620},
    "터키": {"중량 (g)": 320, "열량 (kcal)": 130, "단백질 (g)": 12, "포화지방 (g)": 1, "당류 (g)": 4, "나트륨 (mg)": 400},
    "이탈리안 BMT": {"중량 (g)": 350, "열량 (kcal)": 250, "단백질 (g)": 15, "포화지방 (g)": 4, "당류 (g)": 5, "나트륨 (mg)": 580},
    "미니 로티세리 치킨 샐러드": {"중량 (g)": 94, "열량 (kcal)": 42, "단백질 (g)": 5.3, "포화지방 (g)": 0.6, "당류 (g)": 3, "나트륨 (mg)": 72}

}


sub_topping_nutrition = {
       "베이컨": {
        "중량 (g)": 15,
        "열량 (kcal)": 89,
        "당류 (g)": 1,
        "단백질 (g)": 6,
        "포화지방 (g)": 2,
        "나트륨 (mg)": 420
    },
    "베이컨 비츠": {
        "중량 (g)": 10,
        "열량 (kcal)": 51,
        "당류 (g)": 0,
        "단백질 (g)": 4,
        "포화지방 (g)": 2,
        "나트륨 (mg)": 225
    },
    "페퍼로니": {
        "중량 (g)": 18,
        "열량 (kcal)": 81,
        "당류 (g)": 1,
        "단백질 (g)": 4,
        "포화지방 (g)": 3,
        "나트륨 (mg)": 328
    },
    "아보카도": {
        "중량 (g)": 40,
        "열량 (kcal)": 63,
        "당류 (g)": 0,
        "단백질 (g)": 1,
        "포화지방 (g)": 1,
        "나트륨 (mg)": 108
    },
    "에그마요": {
        "중량 (g)": 80,
        "열량 (kcal)": 205,
        "당류 (g)": 1,
        "단백질 (g)": 5,
        "포화지방 (g)": 7,
        "나트륨 (mg)": 288
    },
    "오믈렛": {
        "중량 (g)": 85,
        "열량 (kcal)": 120,
        "당류 (g)": 0,
        "단백질 (g)": 9,
        "포화지방 (g)": 3,
        "나트륨 (mg)": 410
    },
    "아메리칸 치즈": {
        "중량 (g)": 11,
        "열량 (kcal)": 40,
        "당류 (g)": 0,
        "단백질 (g)": 2,
        "포화지방 (g)": 2,
        "나트륨 (mg)": 200
    },
    "모차렐라 치즈": {
        "중량 (g)": 14,
        "열량 (kcal)": 44,
        "당류 (g)": 0,
        "단백질 (g)": 3,
        "포화지방 (g)": 2,
        "나트륨 (mg)": 82
    },
    "슈레드 치즈": {
        "중량 (g)": 14,
        "열량 (kcal)": 50,
        "당류 (g)": 0,
        "단백질 (g)": 3,
        "포화지방 (g)": 3,
        "나트륨 (mg)": 90
    }
}


bread_nutrition = {
    "화이트": {'중량 (g)': 71, '열량 (kcal)': 202, '단백질 (g)': 6.1, '포화지방 (g)': 0.3, '당류 (g)': 2.8, '나트륨 (mg)': 343},
    "위트": {'중량 (g)': 78, '열량 (kcal)': 192, '단백질 (g)': 8.4, '포화지방 (g)': 0.5, '당류 (g)': 5, '나트륨 (mg)': 257},
    "하티": {'중량 (g)': 75, '열량 (kcal)': 210, '단백질 (g)': 7, '포화지방 (g)': 1, '당류 (g)': 3, '나트륨 (mg)': 340},
    "파마산 오레가노": {'중량 (g)': 74.5, '열량 (kcal)': 213, '단백질 (g)': 6.3, '포화지방 (g)': 0.4, '당류 (g)': 3.2, '나트륨 (mg)': 489},
    "허니오트": {'중량 (g)': 88.6, '열량 (kcal)': 235, '단백질 (g)': 8.8, '포화지방 (g)': 0.6, '당류 (g)': 9.3, '나트륨 (mg)': 306},
    "플랫브레드": {'중량 (g)': 172, '열량 (kcal)': 467, '단백질 (g)': 16.2, '포화지방 (g)': 1.7, '당류 (g)': 3.9, '나트륨 (mg)': 936}
}

cheese_nutrition = {
    "아메리칸치즈": {'중량 (g)': 10, '열량 (kcal)': 35, '단백질 (g)': 1.8, '포화지방 (g)': 1.9, '당류 (g)': 0.4, '나트륨 (mg)': 193},
    "모차렐라치즈": {'중량 (g)': 14, '열량 (kcal)': 44, '단백질 (g)': 2.8, '포화지방 (g)': 2.1, '당류 (g)': 0.2, '나트륨 (mg)': 82.3},
    "슈레드치즈": {'중량 (g)': 14, '열량 (kcal)': 54, '단백질 (g)': 3.2, '포화지방 (g)': 2.4, '당류 (g)': 0, '나트륨 (mg)': 84.7}
}

sub_sauce_nutrition = {
    "머스타드": {'중량 (g)': 21, '열량 (kcal)': 15.3, '단백질 (g)': 1.1, '포화지방 (g)': 0.1, '당류 (g)': 0.2, '나트륨 (mg)': 193},
    "레드 와인 식초": {'중량 (g)': 3.5, '열량 (kcal)': 0.7, '단백질 (g)': 0, '포화지방 (g)': 0, '당류 (g)': 0, '나트륨 (mg)': 0},
    "스모크 바베큐": {'중량 (g)': 21, '열량 (kcal)': 32.8, '단백질 (g)': 0.2, '포화지방 (g)': 0.1, '당류 (g)': 7, '나트륨 (mg)': 132},
    "허니 머스타드": {'중량 (g)': 21, '열량 (kcal)': 38.4, '단백질 (g)': 0.4, '포화지방 (g)': 0.4, '당류 (g)': 6.3, '나트륨 (mg)': 145},
    "스위트 칠리": {'중량 (g)': 21, '열량 (kcal)': 40, '단백질 (g)': 0.1, '포화지방 (g)': 0, '당류 (g)': 9.2, '나트륨 (mg)': 163},
    "스위트 어니언": {'중량 (g)': 21, '열량 (kcal)': 40.1, '단백질 (g)': 0.1, '포화지방 (g)': 0, '당류 (g)': 8.2, '나트륨 (mg)': 81.7},
    "핫 칠리": {'중량 (g)': 21, '열량 (kcal)': 41.8, '단백질 (g)': 0.2, '포화지방 (g)': 0.1, '당류 (g)': 5.3, '나트륨 (mg)': 180},
    "사우스웨스트 치폴레": {'중량 (g)': 21, '열량 (kcal)': 96.5, '단백질 (g)': 0.4, '포화지방 (g)': 1.6, '당류 (g)': 1, '나트륨 (mg)': 160},
    "홀스래디쉬": {'중량 (g)': 21, '열량 (kcal)': 106, '단백질 (g)': 0.3, '포화지방 (g)': 1.6, '당류 (g)': 2.6, '나트륨 (mg)': 152},
    "랜치": {'중량 (g)': 21, '열량 (kcal)': 116, '단백질 (g)': 0.3, '포화지방 (g)': 2.1, '당류 (g)': 0.6, '나트륨 (mg)': 128},
    "올리브 오일": {'중량 (g)': 3.5, '열량 (kcal)': 124, '단백질 (g)': 0, '포화지방 (g)': 2.1, '당류 (g)': 0, '나트륨 (mg)': 0},
    "마요네즈": {'중량 (g)': 21, '열량 (kcal)': 158, '단백질 (g)': 0.3, '포화지방 (g)': 2.8, '당류 (g)': 0.1, '나트륨 (mg)': 98.1}
}


sides_nutrition = {
    "단호박 수프 하프": {'중량 (g)': 118, '열량 (kcal)': 95, '단백질 (g)': 2.1, '포화지방 (g)': 1.5, '당류 (g)': 8.2, '나트륨 (mg)': 158},
    "단호박 수프 레귤러": {'중량 (g)': 237, '열량 (kcal)': 190, '단백질 (g)': 4.2, '포화지방 (g)': 3.1, '당류 (g)': 16.4, '나트륨 (mg)': 317},

    "콘수프 하프": {'중량 (g)': 118, '열량 (kcal)': 81, '단백질 (g)': 2.5, '포화지방 (g)': 1.4, '당류 (g)': 5.3, '나트륨 (mg)': 283},
    "콘수프 레귤러": {'중량 (g)': 237, '열량 (kcal)': 163, '단백질 (g)': 5.2, '포화지방 (g)': 2.8, '당류 (g)': 10.7, '나트륨 (mg)': 569},
    
    "머쉬룸수프 하프": {'중량 (g)': 118, '열량 (kcal)': 64, '단백질 (g)': 1.5, '포화지방 (g)': 2.3, '당류 (g)': 2.2, '나트륨 (mg)': 336},
    "머쉬룸수프 레귤러": {'중량 (g)': 237, '열량 (kcal)': 129, '단백질 (g)': 3.1, '포화지방 (g)': 4.6, '당류 (g)': 4.5, '나트륨 (mg)': 675},
    
    "초코칩쿠키": {'중량 (g)': 45, '열량 (kcal)': 228, '단백질 (g)': 2.1, '포화지방 (g)': 5.6, '당류 (g)': 19.3, '나트륨 (mg)': 165},
    "오트밀레이즌": {'중량 (g)': 45, '열량 (kcal)': 200, '단백질 (g)': 2.4, '포화지방 (g)': 3.8, '당류 (g)': 15.8, '나트륨 (mg)': 130},
    "더블초코칩": {'중량 (g)': 45, '열량 (kcal)': 212, '단백질 (g)': 2.0, '포화지방 (g)': 5.4, '당류 (g)': 19.9, '나트륨 (mg)': 165},
    "라즈베리 치즈케익": {'중량 (g)': 45.0, '열량 (kcal)': 204.0, '단백질 (g)': 2.0, '포화지방 (g)': 5.0, '당류 (g)': 15.8, '나트륨 (mg)': 176.0},   
    "화이트 초코 마카다미아" : {'중량 (g)': 45.0, '열량 (kcal)': 245.0, '단백질 (g)': 2.1, '포화지방 (g)': 5.7, '당류 (g)': 18.9, '나트륨 (mg)': 178.0},
    "웨지 포테이토" : {'중량 (g)': 100.0, '열량 (kcal)': 140.0, '단백질 (g)': 2.5, '포화지방 (g)': 1.5, '당류 (g)': 0.7, '나트륨 (mg)': 369.0},
    "Cheesy 웨지 포테이토" : {'중량 (g)': 114.0, '열량 (kcal)': 194.0, '단백질 (g)': 5.8, '포화지방 (g)': 3.9, '당류 (g)': 0.8, '나트륨 (mg)': 454.0},
    "치킨 베이컨 미니 랩" : {'중량 (g)': 161.0, '열량 (kcal)': 391.0, '단백질 (g)': 20.8, '포화지방 (g)': 7.4, '당류 (g)': 5.5, '나트륨 (mg)': 1091.0},
    "해쉬브라운" : {'중량 (g)': 40.0, '열량 (kcal)': 86.0, '단백질 (g)': 1.0, '포화지방 (g)': 1.2, '당류 (g)': 0.3, '나트륨 (mg)': 158.0}
}
