poke_nutrition = {
    '스파이시 연어 & 참치 프로틴 포케': {
        '원재료 용량(g)': '493',
        '열량(kcal)': '731.06',
        '나트륨(mg)': '912.48',
        '탄수화물(g)': '100.67',
        '당류(g)': '10.44',
        '단백질(g)': '35.22',
        '지방(g)': '20.83',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '4.08',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '45.6%',
            '나트륨': '31.1%',
            '탄수화물': '10.4%',
            '당류': '64.0%',
            '단백질': '38.6%',
            '지방': '0.8%',
            '콜레스테롤': '27.2%'
        }
    },
    '낫또 & 닭가슴살 & 아보카도': {
        '원재료 용량(g)': '593',
        '열량(kcal)': '955.28',
        '나트륨(mg)': '970.2',
        '탄수화물(g)': '105.06',
        '당류(g)': '8.84',
        '단백질(g)': '52.41',
        '지방(g)': '36.16',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '6.5',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '48.5%',
            '나트륨': '32.4%',
            '탄수화물': '8.8%',
            '당류': '95.3%',
            '단백질': '67.0%',
            '지방': '0.8%',
            '콜레스테롤': '43.3%'
        }
    },
    '육회 프로틴 포케': {
        '원재료 용량(g)': '493',
        '열량(kcal)': '811.63',
        '나트륨(mg)': '665.2',
        '탄수화물(g)': '93.96',
        '당류(g)': '6.03',
        '단백질(g)': '38.36',
        '지방(g)': '31.37',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '4.84',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '33.3%',
            '나트륨': '29.0%',
            '탄수화물': '6.0%',
            '당류': '69.7%',
            '단백질': '58.1%',
            '지방': '0.8%',
            '콜레스테롤': '32.3%'
        }
    },
    '들기름 메밀면 샐러드': {
        '원재료 용량(g)': '362',
        '열량(kcal)': '663.1',
        '나트륨(mg)': '979',
        '탄수화물(g)': '78.87',
        '당류(g)': '12.73',
        '단백질(g)': '32.97',
        '지방(g)': '1.75',
        '콜레스테롤(mg)': '3.37',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '49.0%',
            '나트륨': '24.3%',
            '탄수화물': '5.2%',
            '당류': '23.1%',
            '단백질': '61.1%',
            '지방': '0.6%',
            '콜레스테롤': '22.5%'
        }
    },
    '숯불직화미트 메밀면 샐러드': {
        '원재료 용량(g)': '402',
        '열량(kcal)': '761.47',
        '나트륨(mg)': '1166.95',
        '탄수화물(g)': '84.87',
        '당류(g)': '18.73',
        '단백질(g)': '38.56',
        '지방(g)': '1.75',
        '콜레스테롤(mg)': '4.4',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '58.3%',
            '나트륨': '26.2%',
            '탄수화물': '8.8%',
            '당류': '34.1%',
            '단백질': '71.4%',
            '지방': '0.6%',
            '콜레스테롤': '29.3%'
        }
    },
    '육회 메밀면 샐러드': {
        '원재료 용량(g)': '402',
        '열량(kcal)': '729.15',
        '나트륨(mg)': '998.15',
        '탄수화물(g)': '78.87',
        '당류(g)': '20.97',
        '단백질(g)': '36.64',
        '지방(g)': '1.75',
        '콜레스테롤(mg)': '3.37',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '49.9%',
            '나트륨': '24.3%',
            '탄수화물': '5.2%',
            '당류': '38.1%',
            '단백질': '67.9%',
            '지방': '0.6%',
            '콜레스테롤': '22.5%'
        }
    },
    '닭가슴살 메밀면 샐러드': {
        '원재료 용량(g)': '402',
        '열량(kcal)': '710.43',
        '나트륨(mg)': '1122.95',
        '탄수화물(g)': '79.27',
        '당류(g)': '22.73',
        '단백질(g)': '33.6',
        '지방(g)': '33.75',
        '콜레스테롤(mg)': '3.37',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '56.5%',
            '나트륨': '24.5%',
            '탄수화물': '5.2%',
            '당류': '41.3%',
            '단백질': '62.2%',
            '지방': '11.3%',
            '콜레스테롤': '22.5%'
        }
    },
    '소불고기 메밀면 샐러드': {
        '원재료 용량(g)': '402',
        '열량(kcal)': '729.07',
        '나트륨(mg)': '1130.95',
        '탄수화물(g)': '81.27',
        '당류(g)': '18.73',
        '단백질(g)': '36.56',
        '지방(g)': '11.35',
        '콜레스테롤(mg)': '4.17',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '56.5%',
            '나트륨': '25.1%',
            '탄수화물': '7.6%',
            '당류': '34.1%',
            '단백질': '67.7%',
            '지방': '3.8%',
            '콜레스테롤': '27.8%'
        }
    },
    '훈제오리 메밀면 샐러드': {
        '원재료 용량(g)': '402',
        '열량(kcal)': '797.27',
        '나트륨(mg)': '1219.35',
        '탄수화물(g)': '85.07',
        '당류(g)': '18.93',
        '지방(g)': '42.36',
        '콜레스테롤(mg)': '5.85',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '61.0%',
            '나트륨': '26.3%',
            '탄수화물': '6.0%',
            '당류': '34.4%',
            '단백질': '78.4%',
            '지방': '9.3%',
            '콜레스테롤': '39.0%'
        }
    },
    '구운 새우 메밀면 샐러드': {
        '원재료 용량(g)': '402',
        '열량(kcal)': '700.14',
        '나트륨(mg)': '1027.75',
        '탄수화물(g)': '78.87',
        '당류(g)': '21.2',
        '단백질(g)': '33.32',
        '지방(g)': '16.74',
        '콜레스테롤(mg)': '3.47',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '51.4%',
            '나트륨': '24.3%',
            '탄수화물': '5.2%',
            '당류': '38.5%',
            '단백질': '61.7%',
            '지방': '5.6%',
            '콜레스테롤': '23.1%'
        }
    },
    '스파이시 육회 참메샐 with 타바스코® 고추장 핫소스': {
        '원재료 용량(g)': '458',
        '열량(kcal)': '722',
        '나트륨(mg)': '1952',
        '탄수화물(g)': '91',
        '당류(g)': '18',
        '단백질(g)': '27',
        '지방(g)': '21',
        '콜레스테롤(mg)': '4.3',
        '포화지방산(g)': '28',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '97.6%',
            '나트륨': '28.1%',
            '탄수화물': '28.7%',
            '당류': '18.0%',
            '단백질': '50%',
            '지방': '0.0%',
            '콜레스테롤': '50.9%'
        }
    },
    '스파이시 골뱅이 참메샐 with 타바스코® 고추장 핫소스': {
        '원재료 용량(g)': '458',
        '열량(kcal)': '665',
        '나트륨(mg)': '1971',
        '탄수화물(g)': '98',
        '당류(g)': '22',
        '단백질(g)': '21',
        '지방(g)': '21',
        '콜레스테롤(mg)': '3.6',
        '포화지방산(g)': '28',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '98.6%',
            '나트륨': '30.2%',
            '탄수화물': '24%',
            '당류': '22.0%',
            '단백질': '38.9%',
            '지방': '8.6%',
            '콜레스테롤': '38.2%'
        }
    }
}

base_nutrition = {
    '곡물밥 POKE': {
        '원재료 용량(g)': '340',
        '열량(kcal)': '464.59',
        '나트륨(mg)': '698.87',
        '탄수화물(g)': '67.8',
        '당류(g)': '8.1',
        '단백질(g)': '14.36',
        '지방(g)': '15.13',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '3.85',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '34.9%',
            '나트륨': '20.9%',
            '탄수화물': '8.1%',
            '당류': '26.1%',
            '단백질': '28.0%',
            '지방': '0.8%',
            '콜레스테롤': '26.2%'
        }
    },
    '메밀면 POKE': {
        '원재료 용량(g)': '340',
        '열량(kcal)': '414.06',
        '나트륨(mg)': '1291.47',
        '탄수화물(g)': '59.28',
        '당류(g)': '13.23',
        '단백질(g)': '13.13',
        '지방(g)': '13.85',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '3.85',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '64.6%',
            '나트륨': '18.3%',
            '탄수화물': '13.2%',
            '당류': '25.6%',
            '단백질': '25.7%',
            '지방': '0.8%',
            '콜레스테롤': '23.9%'
        }
    },
    '채소만 POKE': {
        '원재료 용량(g)': '270',
        '열량(kcal)': '289.69',
        '나트륨(mg)': '715.92',
        '탄수화물(g)': '32.93',
        '당류(g)': '8.02',
        '단백질(g)': '9.5',
        '지방(g)': '13.36',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '3.85',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '35.8%',
            '나트륨': '10.2%',
            '탄수화물': '8.0%',
            '당류': '17.3%',
            '단백질': '24.7%',
            '지방': '0.8%',
            '콜레스테롤': '25.7%'
        }
    },
    '비건 (곡물밥) POKE': {
        '원재료 용량(g)': '315',
        '열량(kcal)': '439.23',
        '나트륨(mg)': '410.22',
        '탄수화물(g)': '64.37',
        '당류(g)': '7.32',
        '단백질(g)': '11.71',
        '지방(g)': '15.01',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '3.94',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '20.5%',
            '나트륨': '19.9%',
            '탄수화물': '7.3%',
            '당류': '21.3%',
            '단백질': '27.8%',
            '지방': '0.0%',
            '콜레스테롤': '26.3%'
        }
    },
    '비건 (메밀면) POKE': {
        '원재료 용량(g)': '315',
        '열량(kcal)': '388.7',
        '나트륨(mg)': '1002.82',
        '탄수화물(g)': '55.85',
        '당류(g)': '12.45',
        '단백질(g)': '10.49',
        '지방(g)': '13.73',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '3.86',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '50.1%',
            '나트륨': '17.2%',
            '탄수화물': '12.5%',
            '당류': '19.1%',
            '단백질': '25.4%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '비건 (채소만) POKE': {
        '원재료 용량(g)': '245',
        '열량(kcal)': '264.33',
        '나트륨(mg)': '427.27',
        '탄수화물(g)': '29.5',
        '당류(g)': '7.25',
        '단백질(g)': '6.85',
        '지방(g)': '13.24',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '3.86',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '21.4%',
            '나트륨': '9.1%',
            '탄수화물': '7.3%',
            '당류': '12.5%',
            '단백질': '24.5%',
            '지방': '0.0%',
            '콜레스테롤': '25.7%'
        }
    },
    
}


additional_topping_nutrition = {
    '연어': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '60.18',
        '나트륨(mg)': '57',
        '탄수화물(g)': '0.12',
        '당류(g)': '0',
        '단백질(g)': '12.36',
        '지방(g)': '1.14',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '2.9%',
            '나트륨': '0.0%',
            '탄수화물': '0.0%',
            '당류': '22.5%',
            '단백질': '2.1%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '닭가슴살': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '82.88',
        '나트륨(mg)': '252',
        '탄수화물(g)': '0.7',
        '당류(g)': '0.7',
        '단백질(g)': '17.5',
        '지방(g)': '1.12',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '12.6%',
            '나트륨': '0.2%',
            '탄수화물': '0.7%',
            '당류': '31.8%',
            '단백질': '2.1%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '스파이시 연어': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '64.06',
        '나트륨(mg)': '207.36',
        '탄수화물(g)': '4.29',
        '당류(g)': '2.8',
        '단백질(g)': '9.76',
        '지방(g)': '0.87',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '10.4%',
            '나트륨': '1.3%',
            '탄수화물': '2.8%',
            '당류': '17.7%',
            '단백질': '1.6%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '새우': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '56.14',
        '나트륨(mg)': '73.09',
        '탄수화물(g)': '0.09',
        '당류(g)': '0',
        '단백질(g)': '12.69',
        '지방(g)': '0.55',
        '콜레스테롤(mg)': '22.42',
        '포화지방산(g)': '0.15',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '3.7%',
            '나트륨': '0.0%',
            '탄수화물': '0.0%',
            '당류': '23.1%',
            '단백질': '1.0%',
            '지방': '7.5%',
            '콜레스테롤': '1.0%'
        }
    },
    '훈제오리': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '200.41',
        '나트륨(mg)': '420.7',
        '탄수화물(g)': '2.24',
        '당류(g)': '1.33',
        '단백질(g)': '10.85',
        '지방(g)': '16.45',
        '콜레스테롤(mg)': '45.5',
        '포화지방산(g)': '4.34',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '21.0%',
            '나트륨': '0.7%',
            '탄수화물': '1.3%',
            '당류': '19.7%',
            '단백질': '30.5%',
            '지방': '15.2%',
            '콜레스테롤': '28.9%'
        }
    },
    '육회': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '135.54',
        '나트륨(mg)': '330.47',
        '탄수화물(g)': '0.55',
        '당류(g)': '0.2',
        '단백질(g)': '13.86',
        '지방(g)': '8.66',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.72',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '16.5%',
            '나트륨': '0.2%',
            '탄수화물': '0.2%',
            '당류': '25.2%',
            '단백질': '16.0%',
            '지방': '0.0%',
            '콜레스테롤': '4.8%'
        }
    },
    '스파이시 참치': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '78.06',
        '나트륨(mg)': '186.06',
        '탄수화물(g)': '4.26',
        '당류(g)': '2.8',
        '단백질(g)': '14',
        '지방(g)': '0.56',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '9.3%',
            '나트륨': '1.3%',
            '탄수화물': '2.8%',
            '당류': '25.5%',
            '단백질': '1.0%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '소불고기': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '115.5',
        '나트륨(mg)': '266',
        '탄수화물(g)': '4.2',
        '당류(g)': '4.2',
        '단백질(g)': '10.5',
        '지방(g)': '6.3',
        '콜레스테롤(mg)': '16.8',
        '포화지방산(g)': '1.4',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '13.3%',
            '나트륨': '1.3%',
            '탄수화물': '4.2%',
            '당류': '19.1%',
            '단백질': '11.7%',
            '지방': '5.6%',
            '콜레스테롤': '9.3%'
        }
    },
    '스테이크': {
        '원재료 용량(g)': '100',
        '열량(kcal)': '252.16',
        '나트륨(mg)': '57.14',
        '탄수화물(g)': '0.21',
        '당류(g)': '0.15',
        '단백질(g)': '20.4',
        '지방(g)': '18.86',
        '콜레스테롤(mg)': '68.03',
        '포화지방산(g)': '6.59',
        '트랜스지방(g)': '0.34',
        '영양성분 표시기준(%)': {
            '열량': '2.9%',
            '나트륨': '0.1%',
            '탄수화물': '0.2%',
            '당류': '37.1%',
            '단백질': '34.9%',
            '지방': '22.7%',
            '콜레스테롤': '43.9%'
        }
    },
    '비건 숯불 직화 미트': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '172.2',
        '나트륨(mg)': '329',
        '탄수화물(g)': '10.5',
        '당류(g)': '6.3',
        '단백질(g)': '10.5',
        '지방(g)': '9.8',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '1.82',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '16.5%',
            '나트륨': '3.2%',
            '탄수화물': '6.3%',
            '당류': '19.1%',
            '단백질': '18.1%',
            '지방': '0.0%',
            '콜레스테롤': '12.1%'
        }
    },
    '직화 닭다리살': {
        '원재료 용량(g)': '90',
        '열량(kcal)': '135',
        '나트륨(mg)': '423',
        '탄수화물(g)': '3.6',
        '당류(g)': '0.9',
        '단백질(g)': '14.4',
        '지방(g)': '7.2',
        '콜레스테롤(mg)': '72',
        '포화지방산(g)': '2.07',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '21.2%',
            '나트륨': '1.1%',
            '탄수화물': '0.9%',
            '당류': '26.2%',
            '단백질': '13.3%',
            '지방': '24%',
            '콜레스테롤': '13.8%'
        }
    },
    '훈제 꼬들목살': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '231.7',
        '나트륨(mg)': '298.6',
        '탄수화물(g)': '7.3',
        '당류(g)': '0.7',
        '단백질(g)': '8.3',
        '지방(g)': '18.8',
        '콜레스테롤(mg)': '50.1',
        '포화지방산(g)': '3.5',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '14.9%',
            '나트륨': '2.2%',
            '탄수화물': '0.7%',
            '당류': '15.1%',
            '단백질': '34.8%',
            '지방': '16.7%',
            '콜레스테롤': '23.2%'
        }
    },
    '구운 버섯': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '25.07',
        '나트륨(mg)': '4.55',
        '탄수화물(g)': '3.51',
        '당류(g)': '0.09',
        '단백질(g)': '2.5',
        '지방(g)': '0.12',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '0.2%',
            '나트륨': '1.1%',
            '탄수화물': '0.1%',
            '당류': '4.5%',
            '단백질': '0.2%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '구운 새우': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '55.61',
        '나트륨(mg)': '73.2',
        '탄수화물(g)': '0',
        '당류(g)': '0',
        '단백질(g)': '12.7',
        '지방(g)': '0.53',
        '콜레스테롤(mg)': '22.49',
        '포화지방산(g)': '0.15',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '3.7%',
            '나트륨': '0.0%',
            '탄수화물': '0.0%',
            '당류': '23.1%',
            '단백질': '1.0%',
            '지방': '7.5%',
            '콜레스테롤': '1.0%'
        }
    },
    '스파이시 육회': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '130.2',
        '나트륨(mg)': '442.4',
        '탄수화물(g)': '5.6',
        '당류(g)': '3.5',
        '단백질(g)': '11.2',
        '지방(g)': '7',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.63',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '22.1%',
            '나트륨': '1.7%',
            '탄수화물': '3.5%',
            '당류': '20.4%',
            '단백질': '13%',
            '지방': '0.0%',
            '콜레스테롤': '4.2%'
        }
    },
    '스파이시 골뱅이': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '74.2',
        '나트륨(mg)': '460.6',
        '탄수화물(g)': '12.6',
        '당류(g)': '7.7',
        '단백질(g)': '4.02',
        '지방(g)': '0.63',
        '콜레스테롤(mg)': '25.9',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '23%',
            '나트륨': '3.9%',
            '탄수화물': '7.7%',
            '당류': '7.6%',
            '단백질': '1.2%',
            '지방': '8.6%',
            '콜레스테롤': '0.0%'
        }
    },
    '(추가) 야채': {
        '원재료 용량(g)': '30',
        '열량(kcal)': '8.31',
        '나트륨(mg)': '24.45',
        '탄수화물(g)': '1.65',
        '당류(g)': '0',
        '단백질(g)': '0.36',
        '지방(g)': '0.03',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '1.2%',
            '나트륨': '0.1%',
            '탄수화물': '0.0%',
            '당류': '0.0%',
            '단백질': '0.0%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '크루통': {
        '원재료 용량(g)': '4oz',
        '열량(kcal)': '183.21',
        '나트륨(mg)': '7.4',
        '탄수화물(g)': '36.52',
        '당류(g)': '0.08',
        '단백질(g)': '5.23',
        '지방(g)': '1.8',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.08',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '0.4%',
            '나트륨': '1.8%',
            '탄수화물': '0.0%',
            '당류': '0.3%',
            '단백질': '0.1%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '(추가) 곡물밥': {
        '원재료 용량(g)': '100',
        '열량(kcal)': '132.68',
        '나트륨(mg)': '600',
        '탄수화물(g)': '28',
        '당류(g)': '5.2',
        '단백질(g)': '4',
        '지방(g)': '0.52',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '30.0%',
            '나트륨': '1.4%',
            '탄수화물': '0.3%',
            '당류': '0.2%',
            '단백질': '0.0%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '해초 샐러드': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '24.12',
        '나트륨(mg)': '88.2',
        '탄수화물(g)': '1.86',
        '당류(g)': '0',
        '단백질(g)': '0.63',
        '지방(g)': '1.58',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.32',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '4.4%',
            '나트륨': '0.1%',
            '탄수화물': '0.0%',
            '당류': '0.0%',
            '단백질': '0.1%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '(추가) 메밀면': {
        '원재료 용량(g)': '100',
        '열량(kcal)': '26.46',
        '나트륨(mg)': '22.5',
        '탄수화물(g)': '3.9',
        '당류(g)': '0.78',
        '단백질(g)': '2.58',
        '지방(g)': '0.06',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '11.2%',
            '나트륨': '0.2%',
            '탄수화물': '0.0%',
            '당류': '0.1%',
            '단백질': '0.0%',
            '지방': '0.1%',
            '포화지방산': '0.0%'
        }
    },
    '당근 라페': {
        '원재료 용량(g)': '50',
        '열량(kcal)': '52.5',
        '나트륨(mg)': '629',
        '탄수화물(g)': '7.5',
        '당류(g)': '5.5',
        '단백질(g)': '0',
        '지방(g)': '2.5',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.5',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '31.5%',
            '나트륨': '0.4%',
            '탄수화물': '0.3%',
            '당류': '0.0%',
            '단백질': '0.1%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '게살': {
        '원재료 용량(g)': '30',
        '열량(kcal)': '26.46',
        '나트륨(mg)': '223.5',
        '탄수화물(g)': '3.9',
        '당류(g)': '0.78',
        '단백질(g)': '2.58',
        '지방(g)': '0.06',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '0.2%',
            '나트륨': '1.3%',
            '탄수화물': '0.5%',
            '당류': '0.0%',
            '단백질': '0.0%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '아보카도': {
        '원재료 용량(g)': '50',
        '열량(kcal)': '101.55',
        '나트륨(mg)': '3.5',
        '탄수화물(g)': '3.1',
        '당류(g)': '0.35',
        '단백질(g)': '1.25',
        '지방(g)': '9.35',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '1.6',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '0.2%',
            '나트륨': '0.2%',
            '탄수화물': '0.0%',
            '당류': '0.1%',
            '단백질': '0.5%',
            '지방': '0.0%',
            '포화지방산': '0.1%'
        }
    },
    '초계란말이': {
        '원재료 용량(g)': '2ea',
        '열량(kcal)': '23.19',
        '나트륨(mg)': '107.33',
        '탄수화물(g)': '1.27',
        '당류(g)': '0.06',
        '단백질(g)': '2.13',
        '지방(g)': '1.06',
        '콜레스테롤(mg)': '53',
        '포화지방산(g)': '0.29',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '5.4%',
            '나트륨': '0.1%',
            '탄수화물': '0.0%',
            '당류': '0.1%',
            '단백질': '0.1%',
            '지방': '2.7%',
            '포화지방산': '0.0%'
        }
    },
    '고구마큐브': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '110.17',
        '나트륨(mg)': '3.5',
        '탄수화물(g)': '26.54',
        '당류(g)': '10.14',
        '단백질(g)': '0.77',
        '지방(g)': '0.11',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '0.2%',
            '나트륨': '1.3%',
            '탄수화물': '0.5%',
            '당류': '0.0%',
            '단백질': '0.0%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '에그슬라이스': {
        '원재료 용량(g)': '45g',
        '열량(kcal)': '60.75',
        '나트륨(mg)': '94.5',
        '탄수화물(g)': '0.9',
        '당류(g)': '0',
        '단백질(g)': '5.4',
        '지방(g)': '3.915',
        '콜레스테롤(mg)': '182.25',
        '포화지방산(g)': '1.08',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '4.7%',
            '나트륨': '0.3%',
            '탄수화물': '0.0%',
            '당류': '9.8%',
            '단백질': '7.3%',
            '지방': '0.0%',
            '포화지방산': '7.2%'
        }
    },
    '할라피뇨': {
        '원재료 용량(g)': '20',
        '열량(kcal)': '5.4',
        '나트륨(mg)': '334.2',
        '탄수화물(g)': '0.948',
        '당류(g)': '0.428',
        '단백질(g)': '0.184',
        '지방(g)': '0.188',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.02',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '16.7%',
            '나트륨': '0.3%',
            '탄수화물': '0.4%',
            '당류': '0.3%',
            '단백질': '0.3%',
            '지방': '0.0%',
            '포화지방산': '0.1%'
        }
    },
    '가벼운 참치(캔)': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '42.777',
        '나트륨(mg)': '129.63',
        '탄수화물(g)': '1.30',
        '당류(g)': '0',
        '단백질(g)': '6.48',
        '지방(g)': '1.25',
        '콜레스테롤(mg)': '10.37',
        '포화지방산(g)': '0.31',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '6.5%',
            '나트륨': '0.4%',
            '탄수화물': '0.0%',
            '당류': '11.8%',
            '단백질': '2.3%',
            '지방': '3.5%',
            '포화지방산': '2.1%'
        }
    },
    '날치알': {
        '원재료 용량(g)': '10',
        '열량(kcal)': '9.6',
        '나트륨(mg)': '130.5',
        '탄수화물(g)': '0.83',
        '당류(g)': '0',
        '단백질(g)': '1.02',
        '지방(g)': '0.22',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '6.5%',
            '나트륨': '0.3%',
            '탄수화물': '0.0%',
            '당류': '1.9%',
            '단백질': '0.4%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '자숙대두': {
        '원재료 용량(g)': '15',
        '열량(kcal)': '14.25',
        '나트륨(mg)': '0',
        '탄수화물(g)': '2.1',
        '당류(g)': '0',
        '단백질(g)': '1.05',
        '지방(g)': '0',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '0.0%',
            '나트륨': '0.6%',
            '탄수화물': '0.0%',
            '당류': '1.9%',
            '단백질': '0.0%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '단호박 무스': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '124.46',
        '나트륨(mg)': '82.6',
        '탄수화물(g)': '11.2',
        '당류(g)': '5.67',
        '단백질(g)': '0.7',
        '지방(g)': '8.54',
        '콜레스테롤(mg)': '7.35',
        '포화지방산(g)': '1.4',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '4.1%',
            '나트륨': '0.6%',
            '탄수화물': '0.3%',
            '당류': '0.0%',
            '단백질': '0.4%',
            '지방': '0.4%',
            '포화지방산': '0.1%'
        }
    },
    '낫또': {
        '원재료 용량(g)': '50g',
        '열량(kcal)': '113.5',
        '나트륨(mg)': '3.5',
        '탄수화물(g)': '7',
        '당류(g)': '2.45',
        '단백질(g)': '9',
        '지방(g)': '5.5',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.8',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '0.2%',
            '나트륨': '0.4%',
            '탄수화물': '0.1%',
            '당류': '0.5%',
            '단백질': '0.3%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    }
}

sauce_nutrition = {
    '스리라차마요': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '168',
        '나트륨(mg)': '228.5',
        '탄수화물(g)': '8.2',
        '당류(g)': '2.6',
        '단백질(g)': '5.1',
        '지방(g)': '15',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '6.6',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '11.4%',
            '나트륨': '2.5%',
            '탄수화물': '5.1%',
            '당류': '0.7%',
            '단백질': '27.8%',
            '지방': '2.2%',
            '포화지방산': '17.3%'
        }
    },
    '참깨 간장': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '50',
        '나트륨(mg)': '584.8',
        '탄수화물(g)': '10.3',
        '당류(g)': '8',
        '단백질(g)': '0.1',
        '지방(g)': '0.3',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '29.2%',
            '나트륨': '3.2%',
            '탄수화물': '8.0%',
            '당류': '0.6%',
            '단백질': '0.2%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '와사비 간장': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '42',
        '나트륨(mg)': '766.7',
        '탄수화물(g)': '8.4',
        '당류(g)': '7.8',
        '단백질(g)': '0.2',
        '지방(g)': '0.1',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '38.3%',
            '나트륨': '2.6%',
            '탄수화물': '7.8%',
            '당류': '0.4%',
            '단백질': '0.2%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '유자 간장': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '80',
        '나트륨(mg)': '364.7',
        '탄수화물(g)': '18.6',
        '당류(g)': '11.2',
        '단백질(g)': '0.2',
        '지방(g)': '0',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '18.2%',
            '나트륨': '5.7%',
            '탄수화물': '11.2%',
            '당류': '0.4%',
            '단백질': '0.0%',
            '지방': '0.0%',
            '포화지방산': '0.0%'
        }
    },
    '네오 쌈장': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '112',
        '나트륨(mg)': '450.4',
        '탄수화물(g)': '11',
        '당류(g)': '7',
        '단백질(g)': '1.9',
        '지방(g)': '7.2',
        '콜레스테롤(mg)': '3',
        '포화지방산(g)': '1',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '22.5%',
            '나트륨': '3.4%',
            '탄수화물': '7.0%',
            '당류': '3.5%',
            '단백질': '13.3%',
            '지방': '1.0%',
            '포화지방산': '6.7%'
        }
    },
    '저당 참깨 소스': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '136.15',
        '나트륨(mg)': '277.15',
        '탄수화물(g)': '6.37',
        '당류(g)': '0.44',
        '단백질(g)': '0.74',
        '지방(g)': '11.97',
        '콜레스테롤(mg)': '4.96',
        '포화지방산(g)': '1.43',
        '트랜스지방(g)': '0.03',
        '영양성분 표시기준(%)': {
            '열량': '13.9%',
            '나트륨': '2%',
            '탄수화물': '0.4%',
            '당류': '1.3%',
            '단백질': '22.2%',
            '지방': '1.7%',
            '포화지방산': '9.5%'
        }
    },
    '비건 스리라차': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '80',
        '나트륨(mg)': '324.9',
        '탄수화물(g)': '10',
        '당류(g)': '5.9',
        '단백질(g)': '0.5',
        '지방(g)': '4.3',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.7',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '16.2%',
            '나트륨': '3.1%',
            '탄수화물': '5.9%',
            '당류': '0.9%',
            '단백질': '8.0%',
            '지방': '0.0%',
            '포화지방산': '4.7%'
        }
    },
    '비건 크리미 어니언': {
        '원재료 용량(g)': '35',
        '열량(kcal)': '67',
        '나트륨(mg)': '246.6',
        '탄수화물(g)': '9.6',
        '당류(g)': '5.6',
        '단백질(g)': '0.2',
        '지방(g)': '3.1',
        '콜레스테롤(mg)': '1',
        '포화지방산(g)': '1',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '12.3%',
            '나트륨': '3.0%',
            '탄수화물': '5.6%',
            '당류': '0.4%',
            '단백질': '5.7%',
            '지방': '0.3%',
            '포화지방산': '6.7%'
        }
    }
}

