salads_nutrition = {
    '탄단지 샐러디': {'열량(kcal)': '322.9', '탄수화물(g)': '34.3', '당류(g)': '17.6', '단백질(g)': '17.9', '지방(g)': '13.1', '포화지방(g)': '2', '나트륨(mg)': '225.3'},
    '콥 샐러디': {'열량(kcal)': '216.3', '탄수화물(g)': '7.3', '당류(g)': '2.6', '단백질(g)': '19', '지방(g)': '12.1', '포화지방(g)': '4', '나트륨(mg)': '420.1'},
    '노릇두부단호박 샐러디': {'열량(kcal)': '225.1', '탄수화물(g)': '29.4', '당류(g)': '13.6', '단백질(g)': '6.9', '지방(g)': '8.8', '포화지방(g)': '1.1', '나트륨(mg)': '263.8'},
    '그라브락스 연어 샐러디': {'열량(kcal)': '239.3', '탄수화물(g)': '8.9', '당류(g)': '4.3', '단백질(g)': '21.0', '지방(g)': '13.4', '포화지방(g)': '2.7', '나트륨(mg)': '500.8'},
    '로스트닭다리살 샐러디': {'열량(kcal)': '267.5', '탄수화물(g)': '31.1', '당류(g)': '13', '단백질(g)': '13.4', '지방(g)': '9.7', '포화지방(g)': '3.9', '나트륨(mg)': '510.8'}
}

warmbowls_nutrition = {  
    '로스트삼겹 포케볼': {'열량(kcal)': '605.6', '탄수화물(g)': '67.6', '당류(g)': '4.7', '단백질(g)': '20.7', '지방(g)': '29.3', '포화지방(g)': '8.2', '나트륨(mg)': '215.7'},
    '그라브락스 연어 포케볼': {'열량(kcal)': '463.5', '탄수화물(g)': '62.8', '당류(g)': '4.3', '단백질(g)': '23.1', '지방(g)': '13.5', '포화지방(g)': '3.0', '나트륨(mg)': '489'},
    '갈빗살메밀면 누들볼': {'열량(kcal)': '432.1', '탄수화물(g)': '37.4', '당류(g)': '6.0', '단백질(g)': '22.3', '지방(g)': '22.3', '포화지방(g)': '7.7', '나트륨(mg)': '515.3'},
    '칠리베이컨 포케볼': {'열량(kcal)': '507.6', '탄수화물(g)': '64.3', '당류(g)': '5.4', '단백질(g)': '20.3', '지방(g)': '18.6', '포화지방(g)': '6.0', '나트륨(mg)': '307'},
    '우삼겹 포케볼': {'열량(kcal)': '630.7', '탄수화물(g)': '68.9', '당류(g)': '6.1', '단백질(g)': '22.4', '지방(g)': '30.2', '포화지방(g)': '8.7', '나트륨(mg)': '225.9'},
    '노릇노릇두부 포케볼': {'열량(kcal)': '506.9', '탄수화물(g)': '69.9', '당류(g)': '5.7', '단백질(g)': '16.6', '지방(g)': '19.1', '포화지방(g)': '2.7', '나트륨(mg)': '100.5'},
    '바베큐닭다리살 포케볼': {'열량(kcal)': '569.9', '탄수화물(g)': '73.3', '당류(g)': '8.1', '단백질(g)': '27.8', '지방(g)': '18.1', '포화지방(g)': '6.0', '나트륨(mg)': '586.0'},
    '우삼겹메밀면 누들볼': {'열량(kcal)': '413', '탄수화물(g)': '37.6', '당류(g)': '6.2', '단백질(g)': '18.3', '지방(g)': '21.2', '포화지방(g)': '6.1', '나트륨(mg)': '351.1'},
    '그라브락스 연어 파스타 누들볼': {'열량(kcal)': '336', '탄수화물(g)': '29.7', '당류(g)': '3.7', '단백질(g)': '20', '지방(g)': '14.7', '포화지방(g)': '2.2', '나트륨(mg)': '646.4'}
}


protein_boxes_nutrition = {
    '더블 치킨 파스타 박스': {
        '열량(kcal)': '557.7',
        '탄수화물(g)': '44.6',
        '당류(g)': '4.8',
        '단백질(g)': '44.0',
        '지방(g)': '21.0',
        '포화지방(g)': '5.5',
        '나트륨(mg)': '709.0'
    },
    '더블 닭다리살 박스': {
        '열량(kcal)': '657.4',
        '탄수화물(g)': '74.9',
        '당류(g)': '9.3',
        '단백질(g)': '37.3',
        '지방(g)': '22.8',
        '포화지방(g)': '6.7',
        '나트륨(mg)': '973.7'
    },
    '더블 비프 박스': {
        '열량(kcal)': '763',
        '탄수화물(g)': '67.4',
        '당류(g)': '9.6',
        '단백질(g)': '34.1',
        '지방(g)': '40.4',
        '포화지방(g)': '13.5',
        '나트륨(mg)': '671.3'
    },
    '더블 삼겹 박스': {
        '열량(kcal)': '846',
        '탄수화물(g)': '68.1',
        '당류(g)': '5.6',
        '단백질(g)': '35.5',
        '지방(g)': '48.6',
        '포화지방(g)': '13',
        '나트륨(mg)': '549.8'
    }
}


sand_wraps_nutrition = {
    '칠리베이컨 포케랩': {'열량(kcal)': '755.7', '탄수화물(g)': '83.3', '당류(g)': '16.9', '단백질(g)': '22.5', '지방(g)': '37.2', '포화지방(g)': '9.7', '나트륨(mg)': '1094.6'},
    '멕시칸갈빗살 포케랩': {'열량(kcal)': '749.3', '탄수화물(g)': '85.3', '당류(g)': '18.2', '단백질(g)': '20.6', '지방(g)': '36.4', '포화지방(g)': '9.7', '나트륨(mg)': '1170.1'},
    '우삼겹 포케랩': {'열량(kcal)': '691.7', '탄수화물(g)': '76.1', '당류(g)': '9.6', '단백질(g)': '24.6', '지방(g)': '35.4', '포화지방(g)': '9.3', '나트륨(mg)': '1056.9'},
    '바베큐닭다리살 포케랩': {'열량(kcal)': '625.6', '탄수화물(g)': '91.7', '당류(g)': '21.3', '단백질(g)': '24.0', '지방(g)': '18.2', '포화지방(g)': '4.9', '나트륨(mg)': '1409.0'}
}

beverages_nutrition = {
'아메리카노': {'열량(kcal)': '22.5', '탄수화물(g)': '2.4', '당류(g)': '0.0', '단백질(g)': '1.8', '지방(g)': '0.5', '포화지방(g)': '0.0', '나트륨(mg)': '24.3'},
    '그린밀크': {'열량(kcal)': '120.0', '탄수화물(g)': '24.0', '당류(g)': '20.0', '단백질(g)': '3.0', '지방(g)': '1.0', '포화지방(g)': '0.0', '나트륨(mg)': '43.0'},
    '오렌지당근': {'열량(kcal)': '113.0', '탄수화물(g)': '27.0', '당류(g)': '23.0', '단백질(g)': '2.0', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '43.0'},
    '레드크렌즈': {'열량(kcal)': '113.0', '탄수화물(g)': '29.0', '당류(g)': '24.0', '단백질(g)': '1.2', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '43.0'}    
}

dressings_nutrition = {
'발사믹' : {'열량(kcal)': '135.0', '탄수화물(g)': '16.0', '당류(g)': '16.0', '단백질(g)': '0.0', '지방(g)': '8.0', '포화지방(g)': '1.2', '나트륨(mg)': '140.0'},
'레몬' : {'열량(kcal)': '175.0', '탄수화물(g)': '14.0', '당류(g)': '14.0', '단백질(g)': '0.0', '지방(g)': '13.0', '포화지방(g)': '1.9', '나트륨(mg)': '190.0'},
'타바스코 오리엔탈' : {'열량(kcal)': '140.0', '탄수화물(g)': '12.0', '당류(g)': '12.0', '단백질(g)': '1.0', '지방(g)': '10.0', '포화지방(g)': '1.5', '나트륨(mg)': '600.0'},
'오리엔탈' : {'열량(kcal)': '160.0', '탄수화물(g)': '8.0', '당류(g)': '7.0', '단백질(g)': '1.0', '지방(g)': '14.0', '포화지방(g)': '2.2', '나트륨(mg)': '280.0'},
'바질페스토' : {'열량(kcal)': '119.0', '탄수화물(g)': '0.5', '당류(g)': '1.8', '단백질(g)': '2.8', '지방(g)': '10.7', '포화지방(g)': '2.0', '나트륨(mg)': '171.0'},
'시저' : {'열량(kcal)': '240.0', '탄수화물(g)': '5.0', '당류(g)': '4.0', '단백질(g)': '1.0', '지방(g)': '24.0', '포화지방(g)': '3.9', '나트륨(mg)': '290.0'},
'크리미칠리' : {'열량(kcal)': '235.0', '탄수화물(g)': '14.0', '당류(g)': '11.0', '단백질(g)': '0.0', '지방(g)': '20.0', '포화지방(g)': '3.2', '나트륨(mg)': '410.0'},
'크리미할라피뇨' : {'열량(kcal)': '235.0', '탄수화물(g)': '7.0', '당류(g)': '7.0', '단백질(g)': '1.0', '지방(g)': '23.0', '포화지방(g)': '3.6', '나트륨(mg)': '320.0'},
 "고추장비빔": {
        "열량(kcal)": 80,
        "탄수화물(g)": 17,
        "당류(g)": 14,
        "단백질(g)": 1,
        "지방(g)": 1,
        "포화지방(g)": 0.5,
        "나트륨(mg)": 480
    },
  '발사믹(하프)': {'열량(kcal)': '67.5', '탄수화물(g)': '8.0', '당류(g)': '8.0', '단백질(g)': '0.0', '지방(g)': '4.0', '포화지방(g)': '0.6', '나트륨(mg)': '70.0'},
    '레몬(하프)': {'열량(kcal)': '87.5', '탄수화물(g)': '7.0', '당류(g)': '7.0', '단백질(g)': '0.0', '지방(g)': '6.5', '포화지방(g)': '0.95', '나트륨(mg)': '95.0'},
    '타바스코 오리엔탈(하프)': {'열량(kcal)': '70.0', '탄수화물(g)': '6.0', '당류(g)': '6.0', '단백질(g)': '0.5', '지방(g)': '5.0', '포화지방(g)': '0.75', '나트륨(mg)': '300.0'},
    '오리엔탈(하프)': {'열량(kcal)': '80.0', '탄수화물(g)': '4.0', '당류(g)': '3.5', '단백질(g)': '0.5', '지방(g)': '7.0', '포화지방(g)': '1.1', '나트륨(mg)': '140.0'},
    '바질페스토(하프)': {'열량(kcal)': '59.5', '탄수화물(g)': '0.25', '당류(g)': '0.9', '단백질(g)': '1.4', '지방(g)': '5.35', '포화지방(g)': '1.0', '나트륨(mg)': '85.5'},
    '시저(하프)': {'열량(kcal)': '120.0', '탄수화물(g)': '2.5', '당류(g)': '2.0', '단백질(g)': '0.5', '지방(g)': '12.0', '포화지방(g)': '1.95', '나트륨(mg)': '145.0'},
    '크리미칠리(하프)': {'열량(kcal)': '117.5', '탄수화물(g)': '7.0', '당류(g)': '5.5', '단백질(g)': '0.0', '지방(g)': '10.0', '포화지방(g)': '1.6', '나트륨(mg)': '205.0'},
    '크리미할라피뇨(하프)': {'열량(kcal)': '117.5', '탄수화물(g)': '3.5', '당류(g)': '3.5', '단백질(g)': '0.5', '지방(g)': '11.5', '포화지방(g)': '1.8', '나트륨(mg)': '160.0'},
    '고추장비빔(하프)': {'열량(kcal)': '40.0', '탄수화물(g)': '8.5', '당류(g)': '7.0', '단백질(g)': '0.5', '지방(g)': '0.5', '포화지방(g)': '0.25', '나트륨(mg)': '240.0'},
   '사워크림': {'열량(kcal)': '23.2', '탄수화물(g)': '0.5', '당류(g)': '0.3', '단백질(g)': '0.3', '지방(g)': '2.2', '포화지방(g)': '1.4', '나트륨(mg)': '4.0'},
    '버터페스토': {'열량(kcal)': '119.0', '탄수화물(g)': '1.5', '당류(g)': '1.8', '단백질(g)': '2.8', '지방(g)': '10.7', '포화지방(g)': '2.0', '나트륨(mg)': '171.0'},
    '바베큐소스': {'열량(kcal)': '24.6', '탄수화물(g)': '5.5', '당류(g)': '2.8', '단백질(g)': '0.3', '지방(g)': '0.2', '포화지방(g)': '0.0', '나트륨(mg)': '151.2'},
    '화이트치즈소스': {'열량(kcal)': '54.0', '탄수화물(g)': '3.5', '당류(g)': '2.7', '단백질(g)': '0.3', '지방(g)': '4.4', '포화지방(g)': '1.2', '나트륨(mg)': '73.5'},
    '바질페스토': {'열량(kcal)': '119.0', '탄수화물(g)': '1.5', '당류(g)': '1.8', '단백질(g)': '2.8', '지방(g)': '10.7', '포화지방(g)': '2.0', '나트륨(mg)': '171.0'}

}

toppings_nutrition = {
  '닭가슴살': {'열량(kcal)': '84.3', '탄수화물(g)': '2.0', '당류(g)': '1.3', '단백질(g)': '21.0', '지방(g)': '0.4', '포화지방(g)': '0.1', '나트륨(mg)': '118.8'},
    '그라브락스 연어': {'열량(kcal)': '99.1', '탄수화물(g)': '1.4', '당류(g)': '0.4', '단백질(g)': '12.8', '지방(g)': '4.7', '포화지방(g)': '0.3', '나트륨(mg)': '346.8'},
    '로스트닭다리살': {'열량(kcal)': '113.8', '탄수화물(g)': '6.0', '당류(g)': '1.3', '단백질(g)': '10.5', '지방(g)': '5.3', '포화지방(g)': '2.1', '나트륨(mg)': '272.8'},
    '그라운드비프': {'열량(kcal)': '108.0', '탄수화물(g)': '0.0', '당류(g)': '0.0', '단백질(g)': '10.2', '지방(g)': '7.2', '포화지방(g)': '2.9', '나트륨(mg)': '38.4'},
    '우삼겹': {'열량(kcal)': '161.1', '탄수화물(g)': '3.0', '당류(g)': '2.5', '단백질(g)': '9.3', '지방(g)': '12.4', '포화지방(g)': '5.1', '나트륨(mg)': '166.5'},
    '베이컨': {'열량(kcal)': '66.3', '탄수화물(g)': '0.4', '당류(g)': '0.3', '단백질(g)': '3.0', '지방(g)': '5.7', '포화지방(g)': '2.1', '나트륨(mg)': '105.6'},
    '로스트삼겹': {'열량(kcal)': '187.4', '탄수화물(g)': '3.2', '당류(g)': '0.4', '단백질(g)': '9.0', '지방(g)': '15.4', '포화지방(g)': '4.8', '나트륨(mg)': '116.2'},
    '양파': {'열량(kcal)': '8.7', '탄수화물(g)': '2.0', '당류(g)': '1.7', '단백질(g)': '0.3', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.9'},
    '토마토': {'열량(kcal)': '7.6', '탄수화물(g)': '1.7', '당류(g)': '0.9', '단백질(g)': '0.1', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.5'},
    '후리가케': {'열량(kcal)': '12.5', '탄수화물(g)': '1.6', '당류(g)': '0.1', '단백질(g)': '0.5', '지방(g)': '0.5', '포화지방(g)': '0.1', '나트륨(mg)': '69.0'},
    '건자두': {'열량(kcal)': '90.7', '탄수화물(g)': '4.9', '당류(g)': '0.5', '단백질(g)': '2.5', '지방(g)': '6.8', '포화지방(g)': '0.6', '나트륨(mg)': '0.3'},
    '나초칩': {'열량(kcal)': '75.0', '탄수화물(g)': '9.2', '당류(g)': '0.1', '단백질(g)': '1.1', '지방(g)': '3.8', '포화지방(g)': '0.3', '나트륨(mg)': '34.5'},
    '양파베이크': {'열량(kcal)': '55.1', '탄수화물(g)': '5.5', '당류(g)': '1.1', '단백질(g)': '0.4', '지방(g)': '3.5', '포화지방(g)': '1.7', '나트륨(mg)': '5.0'},
    '크랜베리': {'열량(kcal)': '31.4', '탄수화물(g)': '8.6', '당류(g)': '7.4', '단백질(g)': '0.0', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.2'},
    '갈빗살': {'열량(kcal)': '147.2', '탄수화물(g)': '5.5', '당류(g)': '3.8', '단백질(g)': '7.8', '지방(g)': '10.4', '포화지방(g)': '5.1', '나트륨(mg)': '266.1'},
    '에그': {'열량(kcal)': '72.5', '탄수화물(g)': '0.7', '당류(g)': '0.1', '단백질(g)': '6.7', '지방(g)': '4.3', '포화지방(g)': '1.4', '나트륨(mg)': '64.0'},
    '두부': {'열량(kcal)': '100.0', '탄수화물(g)': '8.0', '당류(g)': '1.2', '단백질(g)': '4.2', '지방(g)': '5.7', '포화지방(g)': '0.7', '나트륨(mg)': '12.8'},
    '올리브': {'열량(kcal)': '31.5', '탄수화물(g)': '1.8', '당류(g)': '0.0', '단백질(g)': '0.3', '지방(g)': '2.9', '포화지방(g)': '0.4', '나트륨(mg)': '264.0'},
    '할라피뇨': {'열량(kcal)': '6.7', '탄수화물(g)': '1.3', '당류(g)': '0.0', '단백질(g)': '0.0', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '20.7'},
    '머쉬룸': {'열량(kcal)': '59.1', '탄수화물(g)': '3.0', '당류(g)': '0.4', '단백질(g)': '1.5', '지방(g)': '5.6', '포화지방(g)': '0.9', '나트륨(mg)': '1.1'},
    '옥수수': {'열량(kcal)': '19.5', '탄수화물(g)': '3.6', '당류(g)': '2.1', '단백질(g)': '0.6', '지방(g)': '0.3', '포화지방(g)': '0.0', '나트륨(mg)': '78.6'},
    '양파': {'열량(kcal)': '8.7', '탄수화물(g)': '2.0', '당류(g)': '1.7', '단백질(g)': '0.3', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.9'},
    '토마토': {'열량(kcal)': '7.6', '탄수화물(g)': '1.7', '당류(g)': '0.9', '단백질(g)': '0.1', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.5'},
    '당근라페': {'열량(kcal)': '20.8', '탄수화물(g)': '3.1', '당류(g)': '2.8', '단백질(g)': '0.3', '지방(g)': '0.1', '포화지방(g)': '0.0', '나트륨(mg)': '33.0'},
    '적채': {'열량(kcal)': '6.2', '탄수화물(g)': '1.4', '당류(g)': '0.7', '단백질(g)': '0.3', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '1.1'},
    '에다마메': {'열량(kcal)': '14.1', '탄수화물(g)': '1.2', '당류(g)': '0.2', '단백질(g)': '1.3', '지방(g)': '0.5', '포화지방(g)': '0.1', '나트륨(mg)': '0.6'},
    '견과류': {'열량(kcal)': '90.7', '탄수화물(g)': '4.9', '당류(g)': '0.5', '단백질(g)': '2.5', '지방(g)': '6.8', '포화지방(g)': '0.6', '나트륨(mg)': '0.3'},
    '에그마요': {'열량(kcal)': '122.5', '탄수화물(g)': '2.5', '당류(g)': '0.0', '단백질(g)': '4.5', '지방(g)': '10.5', '포화지방(g)': '2.1', '나트륨(mg)': '140.0'},
    '스윗포테이토': {'열량(kcal)': '126.0', '탄수화물(g)': '17.5', '당류(g)': '9.1', '단백질(g)': '1.4', '지방(g)': '5.6', '포화지방(g)': '1.0', '나트륨(mg)': '98.0'},
    '단호박': {'열량(kcal)': '58.6', '탄수화물(g)': '12.5', '당류(g)': '7.0', '단백질(g)': '0.7', '지방(g)': '0.4', '포화지방(g)': '0.1', '나트륨(mg)': '0.1'},
}

sides_soups_nutrition = {
    
    '양송이 크림스프': {'열량(kcal)': '150.0', '탄수화물(g)': '12.0', '당류(g)': '4.0', '단백질(g)': '3.0', '지방(g)': '10.0', '포화지방(g)': '7.0', '나트륨(mg)': '561.0'},
    '단호박 크림스프': {'열량(kcal)': '218.8', '탄수화물(g)': '21.3', '당류(g)': '15.0', '단백질(g)': '2.5', '지방(g)': '13.8', '포화지방(g)': '10.0', '나트륨(mg)': '325.0'},
    '포테이토 크림스프': {'열량(kcal)': '210.0', '탄수화물(g)': '18.0', '당류(g)': '4.0', '단백질(g)': '7.0', '지방(g)': '12.0', '포화지방(g)': '12.0', '나트륨(mg)': '600.0'},
    '치킨토마토 스튜': {'열량(kcal)': '124.0', '탄수화물(g)': '12.6', '당류(g)': '9.6', '단백질(g)': '4.0', '지방(g)': '2.4', '포화지방(g)': '0.4', '나트륨(mg)': '713.2'},
    '더블 우삼겹 야채죽' : {'열량(kcal)': '174.1', '탄수화물(g)': '26.3', '당류(g)': '1.9', '단백질(g)': '7.3', '지방(g)': '4.7', '포화지방(g)': '0.3', '나트륨(mg)': '521.2'},
    '더블 닭가슴살 누룽지죽' : {'열량(kcal)': '184.3', '탄수화물(g)': '23.5', '당류(g)': '2.1', '단백질(g)': '12.0', '지방(g)': '4.7', '포화지방(g)': '0.8', '나트륨(mg)': '565.3'}
}

