poke_nutrition = {
    '곡물밥 포케': {'열량(kcal)': '340', '탄수화물(g)': '67.8', '당류(g)': '8.1', '단백질(g)': '14.36', '지방(g)': '15.13', '포화지방(g)': '3.93', '나트륨(mg)': '464.59'},
    '메밀면 포케': {'열량(kcal)': '340', '탄수화물(g)': '59.28', '당류(g)': '13.23', '단백질(g)': '13.13', '지방(g)': '13.85', '포화지방(g)': '3.85', '나트륨(mg)': '1291.47'},
    '채소만 포케': {'열량(kcal)': '270', '탄수화물(g)': '32.93', '당류(g)': '8.02', '단백질(g)': '9.5', '지방(g)': '13.36', '포화지방(g)': '3.85', '나트륨(mg)': '715.92'},
    '연어 포케': {'열량(kcal)': '315', '탄수화물(g)': '64.37', '당류(g)': '7.32', '단백질(g)': '11.71', '지방(g)': '15.01', '포화지방(g)': '3.94', '나트륨(mg)': '410.22'},
    '훈제오리 포케': {'열량(kcal)': '315', '탄수화물(g)': '55.85', '당류(g)': '12.45', '단백질(g)': '10.49', '지방(g)': '13.73', '포화지방(g)': '3.86', '나트륨(mg)': '1002.82'},
    '스파이시 연어 포케': {'열량(kcal)': '70', '탄수화물(g)': '2.24', '당류(g)': '1.33', '단백질(g)': '10.85', '지방(g)': '16.45', '포화지방(g)': '4.34', '나트륨(mg)': '420.7'},
    '스파이시 참치 포케': {'열량(kcal)': '70', '탄수화물(g)': '2.24', '당류(g)': '1.33', '단백질(g)': '10.85', '지방(g)': '16.45', '포화지방(g)': '4.34', '나트륨(mg)': '420.7'},
    '소불고기 포케': {'열량(kcal)': '70', '탄수화물(g)': '0.55', '당류(g)': '0.2', '단백질(g)': '13.86', '지방(g)': '8.66', '포화지방(g)': '0.72', '나트륨(mg)': '330.47'},
    '더블 토핑 (연두부 + 고구마큐브)': {'열량(kcal)': '100', '탄수화물(g)': '18.6', '당류(g)': '11.2', '단백질(g)': '12.08', '지방(g)': '0.96', '포화지방(g)': '0', '나트륨(mg)': '171.2'},
}

additional_topping_nutrition = {
    '아보카도': {'열량(kcal)': '70', '탄수화물(g)': '2.45', '당류(g)': '0', '단백질(g)': '2.94', '지방(g)': '7.35', '포화지방(g)': '1.4', '나트륨(mg)': '82.6'},
    '고구마큐브': {'열량(kcal)': '35', '탄수화물(g)': '18.6', '당류(g)': '11.2', '단백질(g)': '0.2', '지방(g)': '0', '포화지방(g)': '0', '나트륨(mg)': '364.7'},
    '닭가슴살': {'열량(kcal)': '70', '탄수화물(g)': '0.7', '당류(g)': '0.7', '단백질(g)': '17.5', '지방(g)': '1.12', '포화지방(g)': '0', '나트륨(mg)': '252'},
    '새우': {'열량(kcal)': '60', '탄수화물(g)': '0.09', '당류(g)': '0', '단백질(g)': '12.69', '지방(g)': '0.55', '포화지방(g)': '0.15', '나트륨(mg)': '73.09'},
    '훈제오리': {'열량(kcal)': '70', '탄수화물(g)': '2.24', '당류(g)': '1.33', '단백질(g)': '10.85', '지방(g)': '16.45', '포화지방(g)': '4.34', '나트륨(mg)': '420.7'},
}

sauce_nutrition = {
    '스리라차 마요': {'열량(kcal)': '100', '탄수화물(g)': '36.52', '당류(g)': '0.08', '단백질(g)': '5.23', '지방(g)': '1.8', '포화지방(g)': '0.08', '나트륨(mg)': '7.4'},
    '참깨 간장': {'열량(kcal)': '132.68', '탄수화물(g)': '28', '당류(g)': '5.2', '단백질(g)': '4', '지방(g)': '0.52', '포화지방(g)': '0', '나트륨(mg)': '600'},
    '와사비 간장': {'열량(kcal)': '35', '탄수화물(g)': '3.9', '당류(g)': '0.78', '단백질(g)': '2.58', '지방(g)': '0.06', '포화지방(g)': '0', '나트륨(mg)': '223.5'},
    '유자 간장': {'열량(kcal)': '50', '탄수화물(g)': '10.3', '당류(g)': '8', '단백질(g)': '0.1', '지방(g)': '0.3', '포화지방(g)': '0', '나트륨(mg)': '584.8'},
    '네오 쌈장': {'열량(kcal)': '35', '탄수화물(g)': '8.4', '당류(g)': '7.8', '단백질(g)': '0.2', '지방(g)': '0.1', '포화지방(g)': '0', '나트륨(mg)': '766.7'},
}

