poke_nutrition = {
    '연어 포케': {'열량(kcal)': '315', '탄수화물(g)': '64.37', '당류(g)': '7.32', '단백질(g)': '11.71', '지방(g)': '15.01', '포화지방(g)': '3.94', '나트륨(mg)': '410.22'},
    '훈제오리 포케': {'열량(kcal)': '315', '탄수화물(g)': '55.85', '당류(g)': '12.45', '단백질(g)': '10.49', '지방(g)': '13.73', '포화지방(g)': '3.86', '나트륨(mg)': '1002.82'},
    '스파이시 연어 포케': {'열량(kcal)': '70', '탄수화물(g)': '2.24', '당류(g)': '1.33', '단백질(g)': '10.85', '지방(g)': '16.45', '포화지방(g)': '4.34', '나트륨(mg)': '420.7'},
    '스파이시 참치 포케': {'열량(kcal)': '70', '탄수화물(g)': '2.24', '당류(g)': '1.33', '단백질(g)': '10.85', '지방(g)': '16.45', '포화지방(g)': '4.34', '나트륨(mg)': '420.7'},
    '소불고기 포케': {'열량(kcal)': '70', '탄수화물(g)': '0.55', '당류(g)': '0.2', '단백질(g)': '13.86', '지방(g)': '8.66', '포화지방(g)': '0.72', '나트륨(mg)': '330.47'},
}

base_nutrition = {
    '곡물밥 POKE': {
        '원재료 용량(g)': '340',
        '열량(kcal)': '464.59',
        '나트륨(mg)': '698.87',
        '탄수화물(g)': '67.8',
        '당류(g)': '8.1',
        '단백질(g)': '14.36',
        '지방(g)': '15.13',
        '콜레스테롤(mg)': '2.25',
        '포화지방(g)': '3.93',
        '트랜스지방(g)': '0',
       
    },
    '메밀면 POKE': {
        '원재료 용량(g)': '340',
        '열량(kcal)': '414.06',
        '나트륨(mg)': '1291.47',
        '탄수화물(g)': '59.28',
        '당류(g)': '13.23',
        '단백질(g)': '13.13',
        '지방(g)': '13.85',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '3.85',
        '트랜스지방(g)': '0',
       
    },
    '채소만 POKE': {
        '원재료 용량(g)': '270',
        '열량(kcal)': '289.69',
        '나트륨(mg)': '715.92',
        '탄수화물(g)': '32.93',
        '당류(g)': '8.02',
        '단백질(g)': '9.5',
        '지방(g)': '13.36',
        '콜레스테롤(mg)': '2.25',
        '포화지방산(g)': '3.85',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '35.8%',
            '나트륨': '10.2%',
            '탄수화물': '8.0%',
            '당류': '17.3%',
            '단백질': '24.7%',
            '지방': '0.8%',
            '콜레스테롤': '25.7%'
        }
    },
    '비건 (곡물밥) POKE': {
        '원재료 용량(g)': '315',
        '열량(kcal)': '439.23',
        '나트륨(mg)': '410.22',
        '탄수화물(g)': '64.37',
        '당류(g)': '7.32',
        '단백질(g)': '11.71',
        '지방(g)': '15.01',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '3.94',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '20.5%',
            '나트륨': '19.9%',
            '탄수화물': '7.3%',
            '당류': '21.3%',
            '단백질': '27.8%',
            '지방': '0.0%',
            '콜레스테롤': '26.3%'
        }
    },
    '비건 (메밀면) POKE': {
        '원재료 용량(g)': '315',
        '열량(kcal)': '388.7',
        '나트륨(mg)': '1002.82',
        '탄수화물(g)': '55.85',
        '당류(g)': '12.45',
        '단백질(g)': '10.49',
        '지방(g)': '13.73',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '3.86',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '50.1%',
            '나트륨': '17.2%',
            '탄수화물': '12.4%',
            '당류': '19.1%',
            '단백질': '25.4%',
            '지방': '0.0%',
            '콜레스테롤': '25.7%'
        }
    },
    '비건 (채소만) POKE': {
        '원재료 용량(g)': '245',
        '열량(kcal)': '264.33',
        '나트륨(mg)': '427.27',
        '탄수화물(g)': '29.5',
        '당류(g)': '7.25',
        '단백질(g)': '6.85',
        '지방(g)': '13.24',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '3.86',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '21.4%',
            '나트륨': '9.1%',
            '탄수화물': '7.2%',
            '당류': '12.5%',
            '단백질': '24.5%',
            '지방': '0.0%',
            '콜레스테롤': '25.7%'
        }
    }
}


additional_topping_nutrition = {
    '가벼운참치': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '75.19',
        '나트륨(mg)': '379.33',
        '탄수화물(g)': '0',
        '당류(g)': '0',
        '단백질(g)': '11.93',
        '지방(g)': '3.01',
        '콜레스테롤(mg)': '28.52',
        '포화지방산(g)': '1.04',
        '트랜스지방(g)': '0.26',
        '영양성분 표시기준(%)': {
            '열량': '19.0%',
            '나트륨': '0.0%',
            '탄수화물': '0.0%',
            '당류': '21.7%',
            '단백질': '5.6%',
            '지방': '9.5%',
            '콜레스테롤': '6.9%'
        }
    },
    '칰햄 오리지널': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '119',
        '나트륨(mg)': '371',
        '탄수화물(g)': '0.7',
        '당류(g)': '0.7',
        '단백질(g)': '11.9',
        '지방(g)': '7.7',
        '콜레스테롤(mg)': '52.5',
        '포화지방산(g)': '2.8',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '18.6%',
            '나트륨': '0.2%',
            '탄수화물': '0.7%',
            '당류': '21.6%',
            '단백질': '14.3%',
            '지방': '17.5%',
            '콜레스테롤': '18.7%'
        }
    },
    '연어': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '60.18',
        '나트륨(mg)': '57',
        '탄수화물(g)': '0.12',
        '당류(g)': '0',
        '단백질(g)': '12.36',
        '지방(g)': '1.14',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '2.9%',
            '나트륨': '0.0%',
            '탄수화물': '0.0%',
            '당류': '22.5%',
            '단백질': '2.1%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '스파이시 연어': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '64.06',
        '나트륨(mg)': '207.36',
        '탄수화물(g)': '4.29',
        '당류(g)': '2.8',
        '단백질(g)': '9.76',
        '지방(g)': '0.87',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '10.4%',
            '나트륨': '1.3%',
            '탄수화물': '2.8%',
            '당류': '17.7%',
            '단백질': '1.6%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '훈제오리': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '200.41',
        '나트륨(mg)': '420.7',
        '탄수화물(g)': '2.24',
        '당류(g)': '1.33',
        '단백질(g)': '10.85',
        '지방(g)': '16.45',
        '콜레스테롤(mg)': '45.5',
        '포화지방산(g)': '4.34',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '21.0%',
            '나트륨': '0.7%',
            '탄수화물': '1.3%',
            '당류': '19.7%',
            '단백질': '30.5%',
            '지방': '15.2%',
            '콜레스테롤': '28.9%'
        }
    },
    '육회': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '135.54',
        '나트륨(mg)': '330.47',
        '탄수화물(g)': '0.55',
        '당류(g)': '0.2',
        '단백질(g)': '13.86',
        '지방(g)': '8.66',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0.72',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '16.5%',
            '나트륨': '0.2%',
            '탄수화물': '0.2%',
            '당류': '25.2%',
            '단백질': '16.0%',
            '지방': '0.0%',
            '콜레스테롤': '4.8%'
        }
    },
    '스파이시 참치': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '78.06',
        '나트륨(mg)': '186.06',
        '탄수화물(g)': '4.26',
        '당류(g)': '2.8',
        '단백질(g)': '14',
        '지방(g)': '0.56',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '9.3%',
            '나트륨': '1.3%',
            '탄수화물': '2.8%',
            '당류': '25.5%',
            '단백질': '1.0%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '소불고기': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '115.5',
        '나트륨(mg)': '266',
        '탄수화물(g)': '4.2',
        '당류(g)': '4.2',
        '단백질(g)': '10.5',
        '지방(g)': '6.3',
        '콜레스테롤(mg)': '16.8',
        '포화지방산(g)': '1.4',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '13.3%',
            '나트륨': '1.3%',
            '탄수화물': '4.2%',
            '당류': '19.1%',
            '단백질': '11.7%',
            '지방': '5.6%',
            '콜레스테롤': '9.3%'
        }
    },
    '더블 토핑 (연두부 + 고구마큐브)': {
        '원재료 용량(g)': '210',
        '열량(kcal)': '169.58',
        '나트륨(mg)': '252.5',
        '탄수화물(g)': '20.36',
        '당류(g)': '7.02',
        '단백질(g)': '8.03',
        '지방(g)': '6.23',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '1.9',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '12.6%',
            '나트륨': '6.3%',
            '탄수화물': '7.0%',
            '당류': '14.6%',
            '단백질': '11.5%',
            '지방': '0.0%',
            '콜레스테롤': '12.7%'
        }
    },
    '닭가슴살': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '82.88',
        '나트륨(mg)': '252',
        '탄수화물(g)': '0.7',
        '당류(g)': '0.7',
        '단백질(g)': '17.5',
        '지방(g)': '1.12',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '12.6%',
            '나트륨': '0.2%',
            '탄수화물': '0.7%',
            '당류': '31.8%',
            '단백질': '2.1%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '새우': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '56.14',
        '나트륨(mg)': '73.09',
        '탄수화물(g)': '0.09',
        '당류(g)': '0',
        '단백질(g)': '12.69',
        '지방(g)': '0.55',
        '콜레스테롤(mg)': '22.42',
        '포화지방산(g)': '0.15',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '3.7%',
            '나트륨': '0.0%',
            '탄수화물': '0.0%',
            '당류': '23.1%',
            '단백질': '1.0%',
            '지방': '7.5%',
            '콜레스테롤': '1.0%'
        }
    },
    '구운 새우': {
        '원재료 용량(g)': '60',
        '열량(kcal)': '55.61',
        '나트륨(mg)': '73.2',
        '탄수화물(g)': '0',
        '당류(g)': '0',
        '단백질(g)': '12.7',
        '지방(g)': '0.53',
        '콜레스테롤(mg)': '22.49',
        '포화지방산(g)': '0.15',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '3.7%',
            '나트륨': '0.0%',
            '탄수화물': '0.0%',
            '당류': '23.1%',
            '단백질': '1.0%',
            '지방': '7.5%',
            '콜레스테롤': '1.0%'
        }
    },
    '구운 오징어': {
        '원재료 용량(g)': '80',
        '열량(kcal)': '57.28',
        '나트륨(mg)': '171.2',
        '탄수화물(g)': '0.08',
        '당류(g)': '0',
        '단백질(g)': '12.08',
        '지방(g)': '0.96',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '8.6%',
            '나트륨': '0.0%',
            '탄수화물': '0.0%',
            '당류': '22.0%',
            '단백질': '1.8%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '구운 버섯': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '25.07',
        '나트륨(mg)': '4.55',
        '탄수화물(g)': '3.51',
        '당류(g)': '0.09',
        '단백질(g)': '2.5',
        '지방(g)': '0.12',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '0',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '0.2%',
            '나트륨': '1.1%',
            '탄수화물': '0.1%',
            '당류': '4.5%',
            '단백질': '0.2%',
            '지방': '0.0%',
            '콜레스테롤': '0.0%'
        }
    },
    '스테이크': {
        '원재료 용량(g)': '100',  # 조리 전 기준
        '열량(kcal)': '252.16',
        '나트륨(mg)': '57.14',
        '탄수화물(g)': '0.21',
        '당류(g)': '0.15',
        '단백질(g)': '20.4',
        '지방(g)': '18.86',
        '콜레스테롤(mg)': '68.03',
        '포화지방산(g)': '6.59',
        '트랜스지방(g)': '0.34',
        '영양성분 표시기준(%)': {
            '열량': '2.9%',
            '나트륨': '0.1%',
            '탄수화물': '0.1%',
            '당류': '37.1%',
            '단백질': '34.9%',
            '지방': '22.7%',
            '콜레스테롤': '43.9%'
        }
    },
    '비건 숯불 직화 미트': {
        '원재료 용량(g)': '70',
        '열량(kcal)': '172.2',
        '나트륨(mg)': '329',
        '탄수화물(g)': '10.5',
        '당류(g)': '6.3',
        '단백질(g)': '10.5',
        '지방(g)': '9.8',
        '콜레스테롤(mg)': '0',
        '포화지방산(g)': '1.82',
        '트랜스지방(g)': '0',
        '영양성분 표시기준(%)': {
            '열량': '16.4%',
            '나트륨': '3.2%',
            '탄수화물': '6.3%',
            '당류': '19.1%',
            '단백질': '18.1%',
            '지방': '0.0%',
            '콜레스테롤': '12.1%'
        }
    }
}

sauce_nutrition = {
    '스리라차 마요': {'원재료 용량(g)': '35','열량(kcal)': '100', '탄수화물(g)': '36.52', '당류(g)': '0.08', '단백질(g)': '5.23', '지방(g)': '1.8', '포화지방(g)': '0.08', '나트륨(mg)': '7.4'},
    '참깨 간장': {'원재료 용량(g)': '35','열량(kcal)': '132.68', '탄수화물(g)': '28', '당류(g)': '5.2', '단백질(g)': '4', '지방(g)': '0.52', '포화지방(g)': '0', '나트륨(mg)': '600'},
    '와사비 간장': {'원재료 용량(g)': '35','열량(kcal)': '35', '탄수화물(g)': '3.9', '당류(g)': '0.78', '단백질(g)': '2.58', '지방(g)': '0.06', '포화지방(g)': '0', '나트륨(mg)': '223.5'},
    '유자 간장': {'원재료 용량(g)': '35','열량(kcal)': '50', '탄수화물(g)': '10.3', '당류(g)': '8', '단백질(g)': '0.1', '지방(g)': '0.3', '포화지방(g)': '0', '나트륨(mg)': '584.8'},
    '네오 쌈장': {'원재료 용량(g)': '35','열량(kcal)': '35', '탄수화물(g)': '8.4', '당류(g)': '7.8', '단백질(g)': '0.2', '지방(g)': '0.1', '포화지방(g)': '0', '나트륨(mg)': '766.7'},
     '고추냉이 간장 소스': { "원재료 용량(g)": "35",
        "열량(kcal)": "42",
        "탄수화물(g)": "8.4",
        "단백질(g)": "0.2",
        "지방(g)": "0.1", "콜레스테롤(mg)": "0","나트륨(mg)": "324.9",
        "포화지방(g)": "0.7",
        "트랜스지방(g)": "0",},   
     "비건 스리라차": {
        "원재료 용량(g)": "35",
        "열량(kcal)": "80",
        "나트륨(mg)": "324.9",
        "탄수화물(g)": "10",
        "당류(g)": "5.9",
        "단백질(g)": "0.5",
        "지방(g)": "4.3",
        "콜레스테롤(mg)": "0",
        "포화지방(g)": "0.7",
        "트랜스지방(g)": "0",
        "영양성분 표시기준(%)": {
            "열량": "16.2%",
            "나트륨": "3.1%",
            "탄수화물": "5.9%",
            "당류": "0.9%",
            "단백질": "8.0%",
            "지방": "0.0%",
            "포화지방산": "4.7%"
        }
    },
    "비건 크리미 어니언": {
        "원재료 용량(g)": "35",
        "열량(kcal)": "67",
        "나트륨(mg)": "246.6",
        "탄수화물(g)": "9.6",
        "당류(g)": "5.6",
        "단백질(g)": "0.2",
        "지방(g)": "3.1",
        "콜레스테롤(mg)": "1",
        "포화지방(g)": "1",
        "트랜스지방(g)": "0",
        "영양성분 표시기준(%)": {
            "열량": "12.3%",
            "나트륨": "3.0%",
            "탄수화물": "5.6%",
            "당류": "0.4%",
            "단백질": "5.7%",
            "지방": "0.3%",
            "포화지방산": "6.7%"
        }
    },
    "비건 참깨 소스": {
        "원재료 용량(g)": "35",
        "열량(kcal)": "58.1",
        "나트륨(mg)": "294",
        "탄수화물(g)": "4.03",
        "당류(g)": "0.21",
        "단백질(g)": "1.05",
        "지방(g)": "4.2",
        "콜레스테롤(mg)": "0",
        "포화지방(g)": "2.35",
        "트랜스지방(g)": "0",
        "영양성분 표시기준(%)": {
            "열량": "14.7%",
            "나트륨": "1.2%",
            "탄수화물": "0.2%",
            "당류": "1.9%",
            "단백질": "7.8%",
            "지방": "0.0%",
            "포화지방산": "15.7%"
        }
    }

}

