salads_nutrition = { 
    '탄단지 샐러디' : {'열량(kcal)': '324.3', '탄수화물(g)': '34.2', '당류(g)': '17.6', '단백질(g)': '18.1', '지방(g)': '14.3', '포화지방(g)': '2', '나트륨(mg)': '268.8'},
    '콥 샐러디' : {'열량(kcal)': '220.7', '탄수화물(g)': '9.1', '당류(g)': '2.5', '단백질(g)': '18.9', '지방(g)': '12.3', '포화지방(g)': '3.9', '나트륨(mg)': '475.7'},
    '로스트닭다리살 샐러디' : {'열량(kcal)': '280.2', '탄수화물(g)': '33.4', '당류(g)': '12.7', '단백질(g)': '12.1', '지방(g)': '11.1', '포화지방(g)': '5.4', '나트륨(mg)': '636.2'},
    '그라브락스 연어 샐러디' : {'열량(kcal)': '241.6', '탄수화물(g)': '10.2', '당류(g)': '3.7', '단백질(g)': '21.1', '지방(g)': '13.1', '포화지방(g)': '2.5', '나트륨(mg)': '539.2'},
    '우삼겹메밀면 샐러디' : {'열량(kcal)': '300.8', '탄수화물(g)': '34.9', '당류(g)': '4.8', '단백질(g)': '18.8', '지방(g)': '10.4', '포화지방(g)': '1.1', '나트륨(mg)': '419.8'},
    '단호박두부 샐러디' : {'열량(kcal)': '236.5', '탄수화물(g)': '31.3', '당류(g)': '11.9', '단백질(g)': '7', '지방(g)': '9.8', '포화지방(g)': '1', '나트륨(mg)': '317.5'},
    '비빔메밀면 샐러디' : {'열량(kcal)': '303.6', '탄수화물(g)': '33.9', '당류(g)': '4.7', '단백질(g)': '26.1', '지방(g)': '7.2', '포화지방(g)': '2.0', '나트륨(mg)': '472.4'},
    '바질카프레제 파스타 샐러디' : {'열량(kcal)': '292.8', '탄수화물(g)': '29.1', '당류(g)': '3.5', '단백질(g)': '13.5', '지방(g)': '13.7', '포화지방(g)': '3.7', '나트륨(mg)': '501.0'},
    '그라브락스 연어 파스타 샐러디' : {'열량(kcal)': '323.1', '탄수화물(g)': '29.6', '당류(g)': '3.4', '단백질(g)': '19.9', '지방(g)': '13.9', '포화지방(g)': '2.0', '나트륨(mg)': '709.7'}}


warmbowls_nutrition = {
    '동원참치마요 웜볼' : {'열량(kcal)': '558.2', '탄수화물(g)': '60.9', '당류(g)': '6.1', '단백질(g)': '25.7', '지방(g)': '23.7', '포화지방(g)': '5.1', '나트륨(mg)': '586.8'},
'칠리베이컨 웜볼' : {'열량(kcal)': '482.6', '탄수화물(g)': '57.4', '당류(g)': '4.1', '단백질(g)': '17.9', '지방(g)': '20.1', '포화지방(g)': '6.3', '나트륨(mg)': '295.2'},
'우삼겹 웜볼' : {'열량(kcal)': '428', '탄수화물(g)': '55.4', '당류(g)': '4.8', '단백질(g)': '20.1', '지방(g)': '14.8', '포화지방(g)': '1.8', '나트륨(mg)': '221.1'},
'머쉬룽두부 웜볼' : {'열량(kcal)': '456.5', '탄수화물(g)': '63.9', '당류(g)': '5.9', '단백질(g)': '13.8', '지방(g)': '17.8', '포화지방(g)': '2.8', '나트륨(mg)': '135.4'},
'바베큐닭다리살 웜볼' : {'열량(kcal)': '512.7', '탄수화물(g)': '59.3', '당류(g)': '9.5', '단백질(g)': '23.9', '지방(g)': '17.5', '포화지방(g)': '6.1', '나트륨(mg)': '663.9'},
'비빔우삼겹 웜볼' : {'열량(kcal)': '445.1', '탄수화물(g)': '59.5', '당류(g)': '7', '단백질(g)': '19.3', '지방(g)': '15.7', '포화지방(g)': '2.6', '나트륨(mg)': '300.3'},
'머쉬룸두부 웜볼' : {'열량(kcal)': '456.5', '탄수화물(g)': '63.9', '당류(g)': '5.9', '단백질(g)': '13.8', '지방(g)': '17.8', '포화지방(g)': '2.8', '나트륨(mg)': '135.4'},


  
}

protein_boxes_nutrition = {
    '더블 치킨 박스': {    '열량(kcal)': '645.0',    '탄수화물(g)': '74.1',    '당류(g)': '13.8',    '단백질(g)': '35.7',    '지방(g)': '22.6',    '포화지방(g)': '3.7',    '나트륨(mg)': '603.8'  },
'더블 닭다리살 박스': {
    '열량(kcal)': '667.1',
    '탄수화물(g)': '82.6',
    '당류(g)': '15.9',
    '단백질(g)': '27.1',
    '지방(g)': '24.2',
    '포화지방(g)': '8.5',
    '나트륨(mg)': '1009.1'
  },
'더블 우삼겹 박스': {
    '열량(kcal)': '592.7',
    '탄수화물(g)': '82.2',
    '당류(g)': '16.7',
    '단백질(g)': '28.4',
    '지방(g)': '16.3',
    '포화지방(g)': '3.0',
    '나트륨(mg)': '643.1'
  }
    
}


sand_wraps_nutrition = {
    
'에그마요 랩' : {'열량(kcal)': '669.7', '탄수화물(g)': '52.5', '당류(g)': '6.4', '단백질(g)': '19.7', '지방(g)': '42.4', '포화지방(g)': '10.0', '나트륨(mg)': '1088.8'},
'오리지널 멕시칸 랩' : {'열량(kcal)': '612.5', '탄수화물(g)': '54.3', '당류(g)': '10.6', '단백질(g)': '19.6', '지방(g)': '35.1', '포화지방(g)': '9.9', '나트륨(mg)': '990.4'},
'치킨 멕시칸 랩' : {'열량(kcal)': '565.4', '탄수화물(g)': '55.4', '당류(g)': '10.9', '단백질(g)': '21.8', '지방(g)': '28.7', '포화지방(g)': '7.4', '나트륨(mg)': '1040.2'},
'닭다리살 멕시칸 랩' : {'열량(kcal)': '624.5', '탄수화물(g)': '60.3', '당류(g)': '11.8', '단백질(g)': '18.3', '지방(g)': '34.6', '포화지방(g)': '10.6', '나트륨(mg)': '1276.0'},
'시저치킨 랩' : {'열량(kcal)': '502.6', '탄수화물(g)': '47.2', '당류(g)': '12.4', '단백질(g)': '21.3', '지방(g)': '26', '포화지방(g)': '6.3', '나트륨(mg)': '905.9'},
'그라브락스 연어 랩' : {'열량(kcal)': '437.5', '탄수화물(g)': '45.4', '당류(g)': '9.7', '단백질(g)': '17.5', '지방(g)': '21', '포화지방(g)': '5.3', '나트륨(mg)': '976.9'},
'로스트닭다리살 랩' : {'열량(kcal)': '559.6', '탄수화물(g)': '47.7', '당류(g)': '9.7', '단백질(g)': '18.4', '지방(g)': '33.2', '포화지방(g)': '10.7', '나트륨(mg)': '1316.8'},
'바질치킨 랩' : {'열량(kcal)': '525.6', '탄수화물(g)': '45.7', '당류(g)': '12.6', '단백질(g)': '23.7', '지방(g)': '27.1', '포화지방(g)': '6.7', '나트륨(mg)': '960.9'},
'칠리베이컨 웜랩' : {'열량(kcal)': '745', '탄수화물(g)': '76.6', '당류(g)': '14', '단백질(g)': '21.7', '지방(g)': '38.9', '포화지방(g)': '11.1', '나트륨(mg)': '1142.3'},
'우삼겹 웜랩' : {'열량(kcal)': '630.3', '탄수화물(g)': '69.7', '당류(g)': '11.5', '단백질(g)': '24.7', '지방(g)': '28.8', '포화지방(g)': '5.8', '나트륨(mg)': '964.3'},
'바베큐닭다리살 웜랩' : {'열량(kcal)': '594.7', '탄수화물(g)': '75', '당류(g)': '16.6', '단백질(g)': '21.1', '지방(g)': '20.9', '포화지방(g)': '7.7', '나트륨(mg)': '1360.3'},
'에그마요 샌드' : {'열량(kcal)': '547.5', '탄수화물(g)': '23.8', '당류(g)': '11.2', '단백질(g)': '16.3', '지방(g)': '35.8', '포화지방(g)': '10.9', '나트륨(mg)': '931.6'},
'치킨토마토 샌드' : {'열량(kcal)': '519.7', '탄수화물(g)': '31.6', '당류(g)': '20', '단백질(g)': '20.9', '지방(g)': '27.7', '포화지방(g)': '10.3', '나트륨(mg)': '829.3'},
'에그베이컨 샌드' : {'열량(kcal)': '518.2', '탄수화물(g)': '29.9', '당류(g)': '17.9', '단백질(g)': '17.7', '지방(g)': '28.8', '포화지방(g)': '12.2', '나트륨(mg)': '854.6'},
'바베큐닭다리살 샌드' : {'열량(kcal)': '415.4', '탄수화물(g)': '29', '당류(g)': '18.5', '단백질(g)': '14.5', '지방(g)': '16.8', '포화지방(g)': '7.3', '나트륨(mg)': '873.6'},
'멕시칸 랩' : {'열량(kcal)': '610.9', '탄수화물(g)': '55.4', '당류(g)': '10.6', '단백질(g)': '19.6', '지방(g)': '34.5', '포화지방(g)': '10.2', '나트륨(mg)': '985.9'},
'동원참치마요 샌드' : {'열량(kcal)': '497.8', '탄수화물(g)': '29.9', '당류(g)': '18.6', '단백질(g)': '23', '지방(g)': '24', '포화지방(g)': '5.9', '나트륨(mg)': '787.3'}
    
}

beverages_nutrition = {
'아메리카노' : {'열량(kcal)': '22.5', '탄수화물(g)': '2.4', '당류(g)': '0.0', '단백질(g)': '1.8', '지방(g)': '0.5', '포화지방(g)': '0.0', '나트륨(mg)': '24.3'},
'그린밀싹' : {'열량(kcal)': '120.0', '탄수화물(g)': '28.0', '당류(g)': '22.0', '단백질(g)': '1.0', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '39.0'},
'오렌지당근' : {'열량(kcal)': '113.0', '탄수화물(g)': '27.0', '당류(g)': '23.0', '단백질(g)': '1.0', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '43.0'},
'레드클렌즈' : {'열량(kcal)': '120.0', '탄수화물(g)': '29.0', '당류(g)': '24.0', '단백질(g)': '1.2', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '43.0'},
'케일바나나' : {'열량(kcal)': '119.0', '탄수화물(g)': '19.0', '당류(g)': '10.0', '단백질(g)': '3.0', '지방(g)': '5.0', '포화지방(g)': '1.0', '나트륨(mg)': '23.0'},
'오렌지망고' : {'열량(kcal)': '105.0', '탄수화물(g)': '23.0', '당류(g)': '20.0', '단백질(g)': '2.0', '지방(g)': '0.7', '포화지방(g)': '0.0', '나트륨(mg)': '0.0'},
'루이보스시나몬' : {'열량(kcal)': '4.0', '탄수화물(g)': '0.0', '당류(g)': '0.0', '단백질(g)': '0.0', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.0'},
'캐모마일레몬그라스' : {'열량(kcal)': '2.0', '탄수화물(g)': '0.0', '당류(g)': '0.0', '단백질(g)': '0.0', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.0'},
 "코크제로": {
        "열량(kcal)": 0,
        "탄수화물(g)": 0,
        "당류(g)": 0,
        "단백질(g)": 0,
        "지방(g)": 0,
        "포화지방(g)": 0,
        "나트륨(mg)": 21.3
    },
 "티키타카 캐모마일피치": {
        "열량(kcal)": 0,
        "탄수화물(g)": 0,
        "당류(g)": 0,
        "단백질(g)": 0,
        "지방(g)": 0,
        "포화지방(g)": 0,
        "나트륨(mg)": 0
    },
 
 "웰치스제로 포도": {
        "열량(kcal)": 0,
        "탄수화물(g)": 8,
        "당류(g)": 0,  
        "단백질(g)": 0,
        "지방(g)": 0,
        "포화지방(g)": 0,
        "나트륨(mg)": 0
    },
 
 "스프라이트제로": {
        "열량(kcal)": 0,
        "탄수화물(g)": 0.7,
        "당류(g)": 0,
        "단백질(g)": 0,
        "지방(g)": 0,
        "포화지방(g)": 0,
        "나트륨(mg)": 11
    },
}

dressings_nutrition = {
'발사믹' : {'열량(kcal)': '135.0', '탄수화물(g)': '16.0', '당류(g)': '16.0', '단백질(g)': '0.0', '지방(g)': '8.0', '포화지방(g)': '1.2', '나트륨(mg)': '140.0'},
'레몬' : {'열량(kcal)': '175.0', '탄수화물(g)': '14.0', '당류(g)': '14.0', '단백질(g)': '0.0', '지방(g)': '13.0', '포화지방(g)': '1.9', '나트륨(mg)': '190.0'},
'타바스코 오리엔탈' : {'열량(kcal)': '140.0', '탄수화물(g)': '12.0', '당류(g)': '12.0', '단백질(g)': '1.0', '지방(g)': '10.0', '포화지방(g)': '1.5', '나트륨(mg)': '600.0'},
'오리엔탈' : {'열량(kcal)': '160.0', '탄수화물(g)': '8.0', '당류(g)': '7.0', '단백질(g)': '1.0', '지방(g)': '14.0', '포화지방(g)': '2.2', '나트륨(mg)': '280.0'},
'바질페스토' : {'열량(kcal)': '119.0', '탄수화물(g)': '0.5', '당류(g)': '1.8', '단백질(g)': '2.8', '지방(g)': '10.7', '포화지방(g)': '2.0', '나트륨(mg)': '171.0'},
'시저' : {'열량(kcal)': '240.0', '탄수화물(g)': '5.0', '당류(g)': '4.0', '단백질(g)': '1.0', '지방(g)': '24.0', '포화지방(g)': '3.9', '나트륨(mg)': '290.0'},
'크리미칠리' : {'열량(kcal)': '235.0', '탄수화물(g)': '14.0', '당류(g)': '11.0', '단백질(g)': '0.0', '지방(g)': '20.0', '포화지방(g)': '3.2', '나트륨(mg)': '410.0'},
'크리미할라피뇨' : {'열량(kcal)': '235.0', '탄수화물(g)': '7.0', '당류(g)': '7.0', '단백질(g)': '1.0', '지방(g)': '23.0', '포화지방(g)': '3.6', '나트륨(mg)': '320.0'},
 "고추장비빔": {
        "열량(kcal)": 80,
        "탄수화물(g)": 17,
        "당류(g)": 14,
        "단백질(g)": 1,
        "지방(g)": 1,
        "포화지방(g)": 0.5,
        "나트륨(mg)": 480
    },
  '발사믹(하프)': {'열량(kcal)': '67.5', '탄수화물(g)': '8.0', '당류(g)': '8.0', '단백질(g)': '0.0', '지방(g)': '4.0', '포화지방(g)': '0.6', '나트륨(mg)': '70.0'},
    '레몬(하프)': {'열량(kcal)': '87.5', '탄수화물(g)': '7.0', '당류(g)': '7.0', '단백질(g)': '0.0', '지방(g)': '6.5', '포화지방(g)': '0.95', '나트륨(mg)': '95.0'},
    '타바스코 오리엔탈(하프)': {'열량(kcal)': '70.0', '탄수화물(g)': '6.0', '당류(g)': '6.0', '단백질(g)': '0.5', '지방(g)': '5.0', '포화지방(g)': '0.75', '나트륨(mg)': '300.0'},
    '오리엔탈(하프)': {'열량(kcal)': '80.0', '탄수화물(g)': '4.0', '당류(g)': '3.5', '단백질(g)': '0.5', '지방(g)': '7.0', '포화지방(g)': '1.1', '나트륨(mg)': '140.0'},
    '바질페스토(하프)': {'열량(kcal)': '59.5', '탄수화물(g)': '0.25', '당류(g)': '0.9', '단백질(g)': '1.4', '지방(g)': '5.35', '포화지방(g)': '1.0', '나트륨(mg)': '85.5'},
    '시저(하프)': {'열량(kcal)': '120.0', '탄수화물(g)': '2.5', '당류(g)': '2.0', '단백질(g)': '0.5', '지방(g)': '12.0', '포화지방(g)': '1.95', '나트륨(mg)': '145.0'},
    '크리미칠리(하프)': {'열량(kcal)': '117.5', '탄수화물(g)': '7.0', '당류(g)': '5.5', '단백질(g)': '0.0', '지방(g)': '10.0', '포화지방(g)': '1.6', '나트륨(mg)': '205.0'},
    '크리미할라피뇨(하프)': {'열량(kcal)': '117.5', '탄수화물(g)': '3.5', '당류(g)': '3.5', '단백질(g)': '0.5', '지방(g)': '11.5', '포화지방(g)': '1.8', '나트륨(mg)': '160.0'},
    '고추장비빔(하프)': {'열량(kcal)': '40.0', '탄수화물(g)': '8.5', '당류(g)': '7.0', '단백질(g)': '0.5', '지방(g)': '0.5', '포화지방(g)': '0.25', '나트륨(mg)': '240.0'}

    
    
}

toppings_nutrition = {
    '닭가슴살' : {'열량(kcal)': '60.8', '탄수화물(g)': '1.1', '당류(g)': '0.3', '단백질(g)': '12.5', '지방(g)': '0.7', '포화지방(g)': '0.3', '나트륨(mg)': '88.3'},
'그라브락스 연어' : {'열량(kcal)': '99.1', '탄수화물(g)': '1.4', '당류(g)': '0.4', '단백질(g)': '12.8', '지방(g)': '4.7', '포화지방(g)': '0.5', '나트륨(mg)': '346.6'},
'로스트닭다리살' : {'열량(kcal)': '120.0', '탄수화물(g)': '6.0', '당류(g)': '1.2', '단백질(g)': '9.0', '지방(g)': '6.6', '포화지방(g)': '3.6', '나트륨(mg)': '324.0'},
'머쉬룸' : {'열량(kcal)': '59.1', '탄수화물(g)': '3.3', '당류(g)': '0.4', '단백질(g)': '1.5', '지방(g)': '5.6', '포화지방(g)': '0.9', '나트륨(mg)': '1.1'},
'메밀면' : {'열량(kcal)': '122.3', '탄수화물(g)': '22.2', '당류(g)': '0.0', '단백질(g)': '4.6', '지방(g)': '1.6', '포화지방(g)': '0.3', '나트륨(mg)': '158.8'},
'그라운드비프' : {'열량(kcal)': '108.0', '탄수화물(g)': '0.0', '당류(g)': '0.0', '단백질(g)': '10.2', '지방(g)': '7.2', '포화지방(g)': '2.9', '나트륨(mg)': '38.4'},
'우삼겹' : {'열량(kcal)': '60.9', '탄수화물(g)': '3.1', '당류(g)': '2.0', '단백질(g)': '9.5', '지방(g)': '0.9', '포화지방(g)': '0.0', '나트륨(mg)': '177.1'},
'베이컨' : {'열량(kcal)': '66.3', '탄수화물(g)': '0.7', '당류(g)': '0.4', '단백질(g)': '3.0', '지방(g)': '5.7', '포화지방(g)': '2.1', '나트륨(mg)': '105.6'},
'두부' : {'열량(kcal)': '100.0', '탄수화물(g)': '8.0', '당류(g)': '1.2', '단백질(g)': '4.2', '지방(g)': '5.7', '포화지방(g)': '0.7', '나트륨(mg)': '12.8'},
'바질파스타' : {'열량(kcal)': '178.6', '탄수화물(g)': '21.2', '당류(g)': '1.2', '단백질(g)': '5.4', '지방(g)': '7.4', '포화지방(g)': '1.3', '나트륨(mg)': '109.9'},
'에그' : {'열량(kcal)': '72.5', '탄수화물(g)': '0.7', '당류(g)': '0.1', '단백질(g)': '6.7', '지방(g)': '4.3', '포화지방(g)': '1.4', '나트륨(mg)': '64.0'},
'에그마요' : {'열량(kcal)': '122.5', '탄수화물(g)': '2.5', '당류(g)': '0.0', '단백질(g)': '4.5', '지방(g)': '10.5', '포화지방(g)': '2.1', '나트륨(mg)': '140.0'},
'스윗포테이토' : {'열량(kcal)': '126.0', '탄수화물(g)': '17.5', '당류(g)': '9.1', '단백질(g)': '1.4', '지방(g)': '5.6', '포화지방(g)': '1.0', '나트륨(mg)': '98.0'},
'단호박' : {'열량(kcal)': '58.6', '탄수화물(g)': '12.5', '당류(g)': '7.0', '단백질(g)': '0.7', '지방(g)': '0.4', '포화지방(g)': '0.1', '나트륨(mg)': '0.1'},
'크랜베리' : {'열량(kcal)': '31.4', '탄수화물(g)': '8.6', '당류(g)': '7.4', '단백질(g)': '0.0', '지방(g)': '0.1', '포화지방(g)': '0.0', '나트륨(mg)': '0.2'},
'옥수수' : {'열량(kcal)': '19.5', '탄수화물(g)': '3.6', '당류(g)': '2.1', '단백질(g)': '0.6', '지방(g)': '0.3', '포화지방(g)': '0.0', '나트륨(mg)': '78.0'},
'당근라페' : {'열량(kcal)': '25.6', '탄수화물(g)': '2.6', '당류(g)': '1.3', '단백질(g)': '0.2', '지방(g)': '1.8', '포화지방(g)': '0.0', '나트륨(mg)': '12.8'},
'양파' : {'열량(kcal)': '8.7', '탄수화물(g)': '2.0', '당류(g)': '1.7', '단백질(g)': '0.3', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.9'},
'양파플레이크' : {'열량(kcal)': '55.1', '탄수화물(g)': '5.5', '당류(g)': '1.1', '단백질(g)': '0.4', '지방(g)': '3.5', '포화지방(g)': '1.7', '나트륨(mg)': '5.0'},
'토마토' : {'열량(kcal)': '7.6', '탄수화물(g)': '1.7', '당류(g)': '0.9', '단백질(g)': '0.4', '지방(g)': '0.1', '포화지방(g)': '0.0', '나트륨(mg)': '0.8'},
'채소볼' : {'열량(kcal)': '17.0', '탄수화물(g)': '3.6', '당류(g)': '0.3', '단백질(g)': '1.1', '지방(g)': '0.2', '포화지방(g)': '0.0', '나트륨(mg)': '81.8'},
'나쵸칩' : {'열량(kcal)': '75.0', '탄수화물(g)': '9.2', '당류(g)': '0.0', '단백질(g)': '1.1', '지방(g)': '3.8', '포화지방(g)': '0.3', '나트륨(mg)': '34.5'},
'올리브' : {'열량(kcal)': '31.5', '탄수화물(g)': '1.8', '당류(g)': '0.0', '단백질(g)': '0.3', '지방(g)': '2.9', '포화지방(g)': '0.4', '나트륨(mg)': '264.0'},
'견과류' : {'열량(kcal)': '89.1', '탄수화물(g)': '3.3', '당류(g)': '0.5', '단백질(g)': '3.1', '지방(g)': '7.7', '포화지방(g)': '0.7', '나트륨(mg)': '0.5'},
'사워크림' : {'열량(kcal)': '23.2', '탄수화물(g)': '0.5', '당류(g)': '0.3', '단백질(g)': '0.3', '지방(g)': '2.2', '포화지방(g)': '1.4', '나트륨(mg)': '4.0'},
'할라피뇨' : {'열량(kcal)': '6.7', '탄수화물(g)': '1.3', '당류(g)': '0.0', '단백질(g)': '0.0', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '293.2'},
'오이' : {'열량(kcal)': '2.8', '탄수화물(g)': '0.6', '당류(g)': '0.3', '단백질(g)': '0.2', '지방(g)': '0.0', '포화지방(g)': '0.0', '나트륨(mg)': '0.6'},
'모짜렐라 슬라이스' : {'열량(kcal)': '65.0', '탄수화물(g)': '0.0', '당류(g)': '0.0', '단백질(g)': '6.3', '지방(g)': '4.5', '포화지방(g)': '2.3', '나트륨(mg)': '137.5'},

    
}

sides_soups_nutrition = {
    '양송이 크림스프' : {'열량(kcal)': '123.8', '탄수화물(g)': '8.8', '당류(g)': '3.8', '단백질(g)': '2.5', '지방(g)': '8.8', '포화지방(g)': '8.8', '나트륨(mg)': '588.8'},
    '콘치즈 스프' : {'열량(kcal)': '188.7', '탄수화물(g)': '21.1', '당류(g)': '13.3', '단백질(g)': '3.3', '지방(g)': '10.0', '포화지방(g)': '5.6', '나트륨(mg)': '555.1'},
    '단호박 크림스프' : {'열량(kcal)': '218.8', '탄수화물(g)': '21.3', '당류(g)': '15.0', '단백질(g)': '2.5', '지방(g)': '13.8', '포화지방(g)': '10.0', '나트륨(mg)': '325.0'},
    '치킨토마토 스튜' : {'열량(kcal)': '124.0', '탄수화물(g)': '12.6', '당류(g)': '9.6', '단백질(g)': '14.0', '지방(g)': '1.8', '포화지방(g)': '0.4', '나트륨(mg)': '713.2'},
    '더블 우삼겹 야채죽' : {'열량(kcal)': '174.1', '탄수화물(g)': '26.3', '당류(g)': '1.9', '단백질(g)': '7.3', '지방(g)': '4.7', '포화지방(g)': '0.3', '나트륨(mg)': '521.2'},
    '더블 닭가슴살 누룽지죽' : {'열량(kcal)': '184.3', '탄수화물(g)': '23.5', '당류(g)': '2.1', '단백질(g)': '12.0', '지방(g)': '4.7', '포화지방(g)': '0.8', '나트륨(mg)': '565.3'}
}

